<!DOCTYPE HTML PUBLIC "-;W3C;DTD HTML 4.01 Transitional;EN">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<meta NAME="robots" CONTENT="all">
<meta NAME="revisit-after" CONTENT="10 days">
<meta NAME="Reply-To" CONTENT="webmaster@netzmafia.de">

<meta NAME="keywords" CONTENT="LAN WAN TCP/IP Computernetze Ethernet Vernetzung Router Hub Switch Protokolle">
<meta NAME="description" CONTENT="Praxisorientierte Einf&uuml;hrung in den Aufbau und die Funktionsweise von Computernetzen.">
<title>Grundlagen Computernetze</title>
</head>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#0000FF" ALINK="#FF0000" VLINK="#FF00FF">
<CENTER><TABLE BORDER=0 WIDTH="90%" >
<TR><TD ALIGN=LEFT><img src="images/eyes.gif"></TD>
<TD ALIGN=RIGHT><H3>Grundlagen Computernetze</H3> 
<BR><B><I>Prof. J&uuml;rgen Plate</I></B></TD></TR>
</TABLE></CENTER>
<HR>

<h1 align=center>Weitverkehrsnetze, Voice-over-IP,<BR>
Poweline Communication, Funknetze</h1>


<H2><A NAME="10.1">&Uuml;bertragungsmedien f&uuml;r Weitverkehrsnetze</A></H2>

<H3>Datex-Netz (veraltet)</H3>
<H4>DATEX-L</H4>
DATEX ist eine Abk&uuml;rzung f&uuml;r "Data Exchange" (Datenaustausch). Das L sagt aus, 
da&szlig; es sich um ein leitungsvermitteltes Netz handelt, d. h. es wird ein 
Leitungsweg zwischen zwei Kommunikationspartnern zur Verf&uuml;gung gestellt. 
Beide Partnerstationen m&uuml;ssen in Datenrate, Code und Protokoll 
&uuml;bereinstimmen. Der Vorteil gegen&uuml;ber dem Telefonnetz liegt im schnellen 
Verbindungsaufbau (0.4 - 1 Sekunde). Da heute Datex-L keine Vorteile mehr
gegen&uuml;ber ISDN hat, ist Datex-L ein auslaufendes Modell.
<P>

<H4>DATEX-P</H4>
Das P steht f&uuml;r "Paket-Vermittlung". Die Daten werden in Form genormter 
und mit Adressinformation versehener Datenbl&ouml;cke (Datenpakete) &uuml;bertragen. 
Stationen, die nicht zur Paket&uuml;bertragung in der Lage sind, werden &uuml;ber 
einen Umsetzer (PAD = Packet Assembly Disassembly) versorgt. Die 
angeschlossenen Stationen k&ouml;nnen mit unterschiedlichen Datenraten 
arbeiten. Die Paket&uuml;bertragung selbst erfolgt im Netz mit 64 KBit/s, wobei
derzeit das Netz auf 1,92 MBit/s ausgebaut wird.
Jedes Datenpaket wird auf dem g&uuml;nstigsten Weg ohne R&uuml;cksicht auf die 
logische Reihenfolge &uuml;bertragen. Zwischen zwei &uuml;ber DATEX-P verbundenen 
Partnern k&ouml;nnen u. U. mehrere &Uuml;bertragungswege existieren. Beim 
Empf&auml;nger wird die korrekte Reihenfolge der Pakete wiederhergestellt.
Inzwischen ist aber der Bedarf an schnellerer Daten&uuml;bertragung erheblich 
gestiegen, so dass als Nachfolgetechnik nun vorzugsweise Frame Relay verwendet wird.
<P>

<H3>Fernsprechnetze und ISDN/DSL</H3>
Das Fernsprechnetz ist das mit Abstand am weitesten ausgebaute
Weitverkehrsnetz. Es dient vor allem zur &Uuml;bertragung von
Telefongespr&auml;chen, aber auch f&uuml;r die Datenkommunikation. Das
Telefonnetz ist ein Beispiel f&uuml;r ein Leitungsvermitteltes Netz. Jedem
Verbindungskanal steht eine Bandbreite von 64 kBit/s zur Verf&uuml;gung. 
Auf analogen Leitungen (Modem) wird diese Grenze allerdings nicht
erreicht. Die Datenrate kann hier bei bester Leitungsqualit&auml;t bis zu
56 kBit/s betragen. Bei einem Zugang &uuml;ber eine Mobilfunkstrecke ist
die Bandbreite allerdings noch geringer. 
<P>
ISDN steht f&uuml;r "Integrated Services Digital Network" = diensteintegrierendes Netz 
(Siehe auch <A HREF="http://www.netzmafia.de/skripten/modem/dfue2.html#2.2">
N&auml;heres im Modem-Skript</A>).
Der ISDN-Basisanschlu&szlig; bietet zwei Kan&auml;le mit einer Bandbreite 64 kBit/s pro
Kanal. Aufgrund der digitalen &Uuml;bertragungsweise steht diese
durchgehend zur Verf&uuml;gung. Neben den beiden Basiskan&auml;len steht noch
der Signalisierungskanal (D-Kanal) mit 16 kBit/s zur Verf&uuml;gung. Dieser
wird nur f&uuml;r die Signalisierung genutzt, w&auml;hrend die beiden B-Kan&auml;le
der eingentlichen Daten&uuml;bertragung dienen.
Neben dem Standardanschlu&szlig; mit 64 kBit/s wird noch der 
ISDN-Prim&auml;rmultiplexanschlu&szlig; (PMxA) PMxA angeboten, der
eine Bandbreite von 2 MBit/s bietet.
Der PMxA hat 30 B-Kan&auml;le mit einer Datenrate von jeweils 64 kBit/s.
Dazu kommt noch ein D-Kanal, der hier im Unterschied zum ISDN-Ba auch
eine Datenrate von 64 kBit/s hat, sowie ein weiterer Kanal f&uuml;r
Rahmenbildung und Rahmenerkennung mit einer Rate von ebenfalls 64
kBit/s. 
<P>
Die Bandbreite f&uuml;r Modems ist selbst bei gutem Signal/Rausch-Abstand auf 
analogen Telefonleitungen ausgereitzt. Jedoch stellen die geringen
&Uuml;bertragungsraten kein Problem der Kupferadern des Telefonanschlusses bis 
zur Vermittlungsstelle dar. Das Problem liegt im Zusammenspiel aller
beteiligten Komponenten des Netzes: Der Weg vom Anschlu&szlig; zur Vermittlungsstelle, 
die &Uuml;bertragungstechnik der Vermittlungsstellen untereinander und der
Weg zu dem Anschlu&szlig; der angew&auml;hlt wurde. Ende der 80er Jahre hat man SDSL (Single 
Line Digital Subscriber Line) und HDSL (High Data Rate Digital
Subscriber Line) entwickelt. So war es nun endlich m&ouml;glich kosteng&uuml;nstige 
2-MBit-Systeme anzubieten. HDSL hat einige Vorteile gegen&uuml;ber SDSL: Drei-
bis vierfache Leitungsl&auml;nge ohne Regeneratoren durch Verwendugn eines andern 
Leitungsprotokolls und einer leistungsstarken Echokompensation. Au&szlig;erdem
verursacht HDSL relativ geringe St&ouml;rungen der benachbarten Adern, diese k&ouml;nnen 
bei SDSL wegen der starken Einstrahlung kaum f&uuml;r andere Anwendungen
(Telefonie) verwendet werden.
ADSL (Asymetric Digital Subscriber Line) und VDSL (Very High Data Rate Digital 
Subscriber Line) wurden ebenfalls Anfang der 90er Jahre entwickelt,
hierdurch wird noch mehr Bandbreite zur Verf&uuml;gung gestellt. 
Mehr dazu im <A HREF="../modem/dfue2.html#2.3"> Modem-Skript</a>.
<P>

<H3>Frame Relay</H3>
Aufgrund des immer breiteren Einsatzes von Glasfaserleitungen ist die
Fehleranf&auml;lligkeit der Daten&uuml;bertragung zur&uuml;ckgegangen. Die
Rechenleistung der Endger&auml;te ist zudem mittlerweile gen&uuml;gend hoch, um
auch Aufgaben der Flu&szlig;steuerung und Verbindungs&uuml;berwachung zu
&uuml;bernehmen. Aus diesem Grunde kann hier das Prinzip des "Fast Packet
Switching" (schnelle Paketvermittlung) zum Einsatz kommen. Das Verfahren 
ist als "Frame Relay" standardisiert worden.  Das Frame-Relay-Verfahren 
arbeitet mit Datenpaketen variabler L&auml;nge, die allerdings ohne 
Fehlerkorrektur vermittelt werden.
Beim Frame-Relay-Verfahren findet die Daten&uuml;bertragung &uuml;ber virtuelle
Verbindungen statt. Die zugeh&ouml;rigkeit eines Datenpaketes zu einer
virtuellen Verbindung wird im Paketheader codiert. Hierf&uuml;r ist das
DLCI (Data Link Connection Identifier) Feld vorgesehen, das insgesamt
10 Bit breit ist. Insgesamt sind maximal 1024 virtuelle Verbindungen
gleichzeitig m&ouml;glich. Die Zahl der virtuellen Verbindungen wird durch
die Anzahl der Bits im Paketheader, die zur Codierung einer Verbindung
dienen begrenzt. Mit 10 Bit k&ouml;nnen demnach 2<SUP>10</SUP> = 1024 virtuelle
Verbindungen dargestellt werden.
Effektiv nutzbar sind allerdings nur 976 virtuelle Verbindungen, da
einige DLCI f&uuml;r Sonderaufgaben reserviert sind.
<P>
Eine virtuelle Verbindung kann dauerhaft eingerichtete werden oder
erst bei Bedarf aufgebaut und nachher abgebaut werden. Im Falle der
dauerhaften Verbindung spricht man von einer "Permanent Virtual
Circuit", abgek&uuml;rzt PVC, anderenfalls von einer "Switched Virtual
Circuit" (SVC).
Die SVCs werden beispielsweise dann eingesetzt, wenn die Verbindung nur
selten punktuell genutzt wird. Eine dauerhafte Verbindung w&uuml;rde in
einem solchen Falle nur unn&ouml;tige Kosten verursachen. Ein Beispiel
hierf&uuml;r ist z.B. die Anbindung von Telearbeitspl&auml;tzen an das
Rechnernetz des Betriebes.
<P>
Das Frame-Relay-Verfahren erm&ouml;glicht zwar einen schnellen
Datenaustausch in paktetvermittelten Datennetzen, doch die &Uuml;bertragung
von Sprache und anderen echtzeitkritischen Datenstr&ouml;men kann hiermit
nicht erfolgen. Bei der &Uuml;bertragung eines Datenpaktes ist die Leitung
f&uuml;r die Zeit der &Uuml;bertragung blockiert; eine begonnene &Uuml;bertragung
eines Paketes kann nicht mehr unterbrochen werden. Aufgrund der
variablen Gr&ouml;&szlig;e der Datenpaktete bei Frame Relay kann die &Uuml;bertragung
daher eine l&auml;ngere Zeit inanspruch nehmen. Ein Weg dieses Problem zu
l&ouml;sen w&auml;re es, die Datenpaketgr&ouml;&szlig;e drastisch zu reduzieren, wie es
z.B. beim ATM-Verfahren festgelegt wurde.
<P>
W&auml;hrend das Datex-Netz bis zur Schicht 3 hinauf definiert ist, umfa&szlig;t der
Standard von Frame-Relay nur noch die Schichten 1 und 2. Die Eigenschaften
in Stichpunkten:
<UL>
<LI> Paketorientiertes Protokoll mit variabler Paketl&auml;nge
<LI> Frames werden in derselben Reihenfolge Empfangen wie sie abgeschickt
wurden, es ist also keine Zwischenspeicherung und Sortierung n&ouml;tig.
<LI> Keine Empfangsbest&auml;tigung, keine Flu&szlig;kontrolle (bleibt h&ouml;heren
Protokollen vorbehalten).
<LI> Fehlererkennung, aber keine Fehlerkorrektur.
<LI> Nur fehlerfreie Frames werden weitergeleitet.
<LI> Transparente Verbindung
</UL>
<P>

<H3>FPS</H3>
FPS (fast packet switching) ist ein schneller Paketvermittlungsdienst, bei
dem Rahmen fester L&auml;nge vermittelt werden. Die Rahmen werden auch als
Zellen bezeichnet, man spricht von Zellenvermittlung (cell switching).
ATM basiert auf FPS. FPS zeichnet sich durch eine variable Bandbreitenzuordnung 
aus. Nur die Informationen im Informationsteil (Header) der Zellen sind mit 
einer Fehlererkennung ausgestattet. Die Zellen werden wie bei ATM &uuml;ber 
virtuelle Verbindungen durch das Netz &uuml;bertragen (zu virtuellen Verbindungen 
siehe 'ATM'). Zellen werden ununterbrochen generiert und &uuml;bertragen, nicht 
belegte Zellen werden im Header als 'leer' gekennzeichnet.
<P>

<H3>ATM</H3>
ATM steht f&uuml;r asynchronous transfer mode = asynchrone &Uuml;bertragungsart.
Diese Hochgeschwindigkeits-Paketvermittlung wurde f&uuml;r Breitband-ISDN (B-ISDN) 
als Vermittlungstechnik entwickelt und ist f&uuml;r Daten, Sprache, Text und Bilder 
gleicherma&szlig;en geeignet. Es gilt als die Technologie der Zukunft. ATM 
basiert auf FPS (fast packet switching). Dabei werden die Daten zu Paketen 
zusammengefa&szlig;t und zum Ziel geroutet. Das zust&auml;ndige Normungs- und 
Standardisierungsgremium ist nicht das IEEE, sondern das ATM-Forum.
Im folgenden soll die Funktion von ATM vereinfacht dargestellt werden.
ATM arbeitet verbindungsorientiert, d. h. vor der &Uuml;bertragung mu&szlig; eine 
Verbindung erst geschaltet werden. Wie bei der klassischen Telefontechnik 
wird die Verbindung "irgendwie" geschaltet; wenn der k&uuml;rzeste Weg bereits 
ausgelastet ist, wird ein Ausweichweg verwendet (salopp gesagt: Wenn 
die Strecke N&uuml;rnberg-M&uuml;nchen ausgelastet ist, wird eben der Weg 
N&uuml;rnberg-Flensburg-M&uuml;nchen gew&auml;hlt). 
<P>
Im Kontrollfeld (Header) werden auch keine expliziten Quell- und Zieladressen 
angegeben, sondern ein virtueller Pfad und ein virtueller Kanal. <BR>
Ein virtueller Pfad (virtual path, VP) ist eine f&uuml;r kurze Zeit geschaltete 
Verbindung, die w&auml;hrend ihrer Existenz so aussieht wie eine richtige 
Festverbindung (Standleitung). 
Dieser geschaltete Weg durch das Netz wird als virtuell bezeichnet, weil 
er nicht permanent fest geschaltet ist, sondern nur f&uuml;r die kurze Zeit der 
Daten&uuml;bertragung. <BR>
Zur Kennzeichnung wird ihr ein VPI (virtual path identifier) 
als Bezeichnung zugeordnet. Ein virtueller Kanal (virtual channel, VC) ist 
ein &Uuml;bertragungskanal, der genau wie der virtuelle Pfad nur w&auml;hrend der 
Daten&uuml;bertragung existiert. Zur Kennzeichnung wird ihm ein VCI 
(virtual channel identifier) als Bezeichnung zugeordnet. <BR>
Ein virtueller Pfad besteht aus mehreren virtuellen Kan&auml;len, komplexe Anwendungen 
k&ouml;nnen mehrere virtuelle Kan&auml;le gleichzeitig belegen. Die klassischen 
Standleitungen enthalten ebenfalls mehrere &Uuml;bertragungskan&auml;le, doch k&ouml;nnen 
die virtuellen Kan&auml;le bei ATM die virtuellen Pfade (Leitungen) wechseln. 
Wenn beispielsweise zwei virtuelle Kan&auml;le auf Pfad 1 ankommen, kann Kanal 
1 durchaus auf Pfad 2 und Kanal 2 auf Pfad 1 zum selben Zielnetz geschaltet 
werden.
<P>
<UL>
<LI> Bei VP-Switches bleiben die Kan&auml;le den virtuellen Pfaden fest zugeordnet, 
die Pfade werden durch das Netz geschaltet. 
<LI> Bei VC-Switches werden die Kan&auml;le &uuml;ber verschiedene Pfade geschaltet. 
Bei den geschalteten Verbindungen gibt es zwei wichtige Arten: 
  <UL>
  <LI> Eine PVC (permanent virtual circuit = permanente virtuelle Verbindung) 
  bleibt auch im unbenutzten Fall so lange geschaltet, bis sie wieder gewollt 
  abgebaut wird. 
  <LI> Eine SVC (switched virtual circuit = geschaltete vinuelle Verbindung) 
  bleibt nur f&uuml;r die Dauer der &Uuml;bertragung geschaltet und wird nach 
  &Uuml;bertragungsende automatisch wieder abgebaut. 
  </UL>
</UL>
<P>
Bei der Wegewahl wird eine einfache Art des Routings verwendet, um die 
Datenpakete durch das Netz zu senden. Der Weg, den das Datenpaket durch 
das ATM-Netz zur&uuml;cklegt, besteht dabei aus drei Hauptabschnitten:
<OL>
<LI> Vom Absender zum Switch, an dem der Absender angeschlossen ist.
<LI> Vermittlung innerhalb des ATM-Netzes von Switch zu Switch.
<LI> Vom Switch, an dem der Empf&auml;nger angeschlossen ist, zum Empf&auml;nger.
</OL>
Als &Uuml;bertragungsverfahren wird bei ATM das Paketvermittlungsverfahren Cell 
Relay ("Zellenvermittlung") verwendet. Bei diesen Zellen handelt es sich 
um Rahmen fester L&auml;nge mit 5 Byte Header f&uuml;r Adressierung und Steueranweisungen 
sowie 48 Byte Nutzdaten, insgesamt also 53 Byte. Dabei wird zwischen zwei 
unterschiedlichen Zelltypen unterschieden. 
<UL>
<LI> Die UNI-Zellen (user network interface) werden an der Schnittstelle 
zwischen Anwender und ATM-Netz verwendet und besitzen im Header 8 Bit f&uuml;r 
die Angabe des virtuellen Pfades und 4 Bit f&uuml;r die Flu&szlig;kontrolle. 
<LI>Die NNI-Zellen (network node interface) werden zwischen den 
Netzwerkknoten (ATM-Switches) verwendet und besitzen 12 Bit f&uuml;r die Angabe 
des virtuellen Pfades, jedoch keine Flu&szlig;kontrolle. 
</UL>
Die Zellen werden von den Switches an den entsprechenden Trennstellen im 
ATM-Netz automatisch umgewandelt. Durch die sogenannte 'cell loss priority', 
die Verlustpriorit&auml;t, wird festgelegt, welche Zellen auch bei sehr hoher 
Auslastung des Netzes noch unbedingt &uuml;bertragen werden m&uuml;ssen (z. B. 
kritische Daten oder Synchronisationsanweisungen) und welche gegebenenfalls 
auch verloren gehen k&ouml;nnen (z. B. Bildinformation bei Bildtelefonie). 
Die Fehlerkontrolle bezieht sich nur auf den 5 Byte gro&szlig;en Header, nicht 
jedoch auf die Daten. Es ist ATM v&ouml;llig egal, was &uuml;bertragen wird, wichtig 
ist nur wohin und wie. Das ist auch ein Grund f&uuml;r die Schnelligkeit.
Die wichtigsten &Uuml;bertragungsraten sind 622 MBit/s (Lichtwellenleiter),
155 MBit/s (LWL und Kupferleitungen), 100 MBit/s (LWL und FDDI) und
26 MBit/s (Kupferleitungen).
<P>
ATM kann Datenstr&ouml;me unterschiedlicher Bitraten flexibel &uuml;bertragen und
vermitteln. Die &Uuml;bertragungsrate ist skalierbar, d. h. &Uuml;bertragungsbandbreite
wird flexibel bereitgestellt. Jedem Endger&auml;t kann statisch (also vorab) oder 
dynamisch (also bei konkretem Bedarf) Bandbreite zugewiesen werden, die 
Netzleistung w&auml;chst also mit. Durch die transparente &Uuml;bertragung in den 
Zellen werden bei den Netz&uuml;berg&auml;ngen keine Gateways ben&ouml;tigt, um von LAN- 
auf WAN-Protokolle umzusetzen. ATM ist gleicherma&szlig;en f&uuml;r LANs, schnelle 
Backbones und WANs geeignet.
<P>
ATM ist verbindungsorientiert und baut immer eine Punkt-zu-Punkt-Verbindung 
auf. F&uuml;r eine &Uuml;bertragung mu&szlig; also immer eine Verbindung zwischen zwei 
Stationen geschaltet werden (ATM basiert auf der Vermittlungstechnik).
Klassische LANS sind verbindungslos, jede Station ist zu jeder Zeit mit 
allen anderen Stationen fest verbunden, alle teilen sich dasselbe 
&Uuml;bertragungsmedium. ATM als LAN (lokales ATM, L-ATM) ben&ouml;tigt eine 
LAN-Emulation. So entsteht ein virtuelles Netz, bei dem das ATM-Netz  
mehreren Teilnehmern (Ger&auml;te/Software) ein nichtexistierendes 
LAN vorspiegeln mu&szlig;. Dabei sind verschiedene Ans&auml;tze allerdings
noch in Diskussion. Diese LAN-Emulationen arbeiten alle auf Schicht 2 des
ISO-Schichtenmodells, dadurch eignen sie sich f&uuml;r routebare und nicht 
routebare Protokolle gleicherma&szlig;en. F&uuml;r die &Uuml;bertragung von IP-Paketen 
&uuml;ber ATM haben sich die nachfolgend beschriebenen 3 Verfahren heute etabliert.
<UL>
<LI><I>CLIP</I><BR>
  Dies ist die Abk&uuml;rzung f&uuml;r "Classical IP". Hier werden die Datenpakete
  aus unterschiedlichen Netzen &uuml;ber ATM transportiert. Die Datenpakete
  aus verschiedenen Netzformen (wie Ethernet, Token-Ring) k&ouml;nnen in
  einem Fall nach der "Logical Link Control Encapsulation"-Methode alle
  &uuml;ber eine virtuelle Verbindung &uuml;bertragen werden. Die ATM-Zellen
  werden mit Header-Informationen &uuml;ber den Protokolltyp des
  transportierten Datenpaketes versehen. Zur effizienten Gestaltung
  des Datentransportes kann auch je Protokolltyp eine virtuelle
  Verbindung aufgebaut werden. Das Feld mit der Typangabe f&uuml;r die
  transportierten Pakete kann enfallen, so das mehr Raum f&uuml;r
  Nutzinformationen zur Verf&uuml;gung steht. Die mittels CLIP
  transportierten Datenpakete k&ouml;nnen allerdings hinsichtlich der
  IP-Adressen nur immer innerhalb eines IP-Subnetzes transportiert
  werden, da hier keine M&ouml;glichkeit des Routings &uuml;ber ATM besteht.
  <P>
<LI><I>LANE</I><BR>
  Das LAN-Emulationsverfahren (LANE) simuliert die Abl&auml;ufe
  und Funktionen eines herk&ouml;mmlichen LAN. Hierdurch kann eine
  existierendes LAN auf ATM abgebildet werden. Das emulierte LAN (ELAN)
  hat eine Client/Serverarchitektur, bei der jedes Endger&auml;t einen
  softwareseitigen "LAN Emulation Client" (LEC) besitzt. Dieser
  unterh&auml;lt Steuerverbindungen zu den einzelnen LANE-Servern. Eine
  Nutzdatenverbindung kann direkt zu den anderen LEC aufgebaut werden.
  Daneben kann auch eine Broadcastsendung verschickt werden, indem
  einen Nachricht an den "Broadcast and Unknown Server" (BUS) geschickt
  wird, der diese Nachricht dann an alle Clients verteilt. Das ELAN
  wird von einem "LAN Emulation Configuration Server" konfiguriert.
  Daneben ist noch ein LAN-Emulations-Server installiert, der zur
  Registrierung einzelner Clients und zur Ermittlung von Adressen
  dient. Die Teilnehmer des emulierten LAN geh&ouml;ren alle zu einem
  Subnetz. Es besteht mittels LANE keine M&ouml;glichkeit, Datenpakete
  zwischen einzelnen LANE-Netzen zu routen. Auch die Garantie einer
  Dienstg&uuml;te ist bei LANE nicht m&ouml;glich.
  <P>
<LI><I>MPoA</I><BR>
  Das "Multiprotocol Encapsulation over ATM"-Verfahren
  beseitigt die Nachteile der anderen beiden Verfahren hinsichtlich
  des Routings zwischen den Subnetzen. Zudem kann hier die Diensteg&uuml;te
  f&uuml;r einzelne Dienste garantiert werden. Das Netz besteht aus 
  MPoA-Servern und MPoA-Clients. 
  Die MPoA-Server dienen als virtelle Router, welche die Aufgabe haben,
  die Route zum Zielnetz zu ermitteln. Im Gegensatz zu den
  herk&ouml;mmlichen Routern, die auch den Transport der Daten &uuml;bernehmen,
  sind die Router hier allerdings nur f&uuml;r die Wegewahl zust&auml;ndig. Die
  MPoA-Clients bauen mit den Informationen der MPoA-Server die
  gew&uuml;nschte Verbindung auf, und &uuml;bernehmen den eigentlichen
  Datentransport.
</UL>
<H3>Gegen&uuml;berstellung der Technologien</H3>
<P><UL>
<TABLE BORDER=1 CELLPADDING=3 CELLSPACING=0>
<TR>
<TD ALIGN="LEFT">&nbsp;</TD>
<TD ALIGN="LEFT">Telefonnetz</TD>
<TD ALIGN="LEFT">Paketnetz (Datex, X.25)</TD>
<TD ALIGN="LEFT">Frame-Relay</TD>
<TD ALIGN="LEFT">ATM</TD>
</TR>
<TR>
<TD ALIGN="LEFT">Vermittlungsprinzip</TD>
<TD ALIGN="LEFT">Leitungsvermittlung</TD>
<TD ALIGN="LEFT">Paketvermittlung</TD>
<TD ALIGN="LEFT">schnelle Paketvermittlung</TD>
<TD ALIGN="LEFT">Zellvermittlung</TD>
</TR>
<TR>
<TD ALIGN="LEFT">Fehlerkorrektur im Netz</TD>
<TD ALIGN="LEFT">nein</TD>
<TD ALIGN="LEFT">ja</TD>
<TD ALIGN="LEFT">nein</TD>
<TD ALIGN="LEFT">nein</TD>
</TR>
<TR>
<TD ALIGN="LEFT">Paketgr&ouml;&szlig;e</TD>
<TD ALIGN="LEFT">keine Pakete</TD>
<TD ALIGN="LEFT">variabel</TD>
<TD ALIGN="LEFT">variabel</TD>
<TD ALIGN="LEFT">fest (53 Byte)</TD>
</TR>
<TR>
<TD ALIGN="LEFT">mehrere Verbindungen gleichzeitig</TD>
<TD ALIGN="LEFT">nein</TD>
<TD ALIGN="LEFT">ja</TD>
<TD ALIGN="LEFT">ja</TD>
<TD ALIGN="LEFT">ja</TD>
</TR>
<TR><TD ALIGN="LEFT">Durchsatz der Netzknoten</TD>
<TD ALIGN="LEFT">sehr hoch</TD>
<TD ALIGN="LEFT">mittel</TD>
<TD ALIGN="LEFT">hoch</TD>
<TD ALIGN="LEFT">sehr hoch</TD>
</TR>
</TABLE></UL>
<P>

<H3>Punkt-zu-Punkt-Verbindungen</H3>
Bei gr&ouml;&szlig;eren Entfernungen zwischen zwei Punkten kommen 
fast ausschlie&szlig;lich Glasfaserleitungen zum Einsatz. Sie bieten
theoretisch m&ouml;gliche Kapazit&auml;ten im TBit/s-Bereich. 
In der Boom-Phase des Internet um die Jahrteusendwende vergruben die 
Telekommunikationsunternehmen zehntausende Kilometer teures Glasfaserkabel 
in ganz Europa. Einige Energieversorger sind ins Gesch&auml;ft mit den 
Lichtwellenstrecken eingestiegen und machen sich dabei ihre bestehende 
Infrastruktur zunutze. Der Bedarf blieb jedoch hinter den Erwartungen zurück.
<P>
<center><img src="images/bw_wachs.jpg"></center><br>
<small>Quelle: TeleGeography Research, PriMetrica Inc, 
<a href="http://www.telegeography.com">www.telegeography.com</a></small>
<P>
Angemietet wurden die Lichtwellenleiter von den Providern meist "dunkel" 
(Dark Fiber), also unbeschaltet. Wenn ein IP-Carrier neue Punkt-zu-Punkt-Strecken 
ben&ouml;tigt, kann er bei den Dark-Fiber-Versorgern Faser(n) anmieten. 
Der Dark-Fiber-Anbieter verlegt Kabel verschiedener Hersteller. In einem 
LEAF-Kabel (Large Effective Area Fiber) beispielsweise stehen 144 Fasern zur 
Verf&uuml;gung. Mit welcher Kapazit&auml;t der Carrier die Fasern beschaltet, 
liegt in seinem Ermessen. Die technische Ausstattung daf&uuml;r richtet er selbst ein.
<p>
Um eine fl&auml;chendeckende Versorgung mit seinem Backbone-Netz zu gew&auml;hrleisten, 
muss ein IP-Carrier zumindest in mehreren Gro&szlig;st&auml;dten vertreten sein. Dazu 
betreibt er dann "Points of Presence" (PoPs), die über Punkt-zu-Punkt-Glasfasertrassen 
verbunden sind. Von dort aus f&uuml;hren sie au&szlig;erdem IP-Leitungen zu ihren Kunden. 
Au&szlig;erdem arbeiten die IP-Carrier oft auch als Internet Service Provider. In 
den PoPs finden &uuml;berdies noch Router von kleineren lokalen Carriern Platz, die 
mit dem gro&szlig;en Nachbarn IP-Daten austauschen. Die PoPs dienen innerhalb des 
Carrier_netzes als Datendrehscheibe. Um mehr Bandbreite aus einer Faser herhauszuholen, 
hat sich das "Dense Wavelength Division Multiplexing" (DWDM) durchgesetzt. Dabei werden 
mehrere Signale multiplex in den Lichtwellenleiter eingespeist. Pro Wellenl&auml;nge und 
Faser lassen sich heutzutage Bitraten von 1 GBit/s bis 40 GBit/s erreichen. 
Auf dem Weg durch den Lichtwellenleiter wird das Signal ged&auml;pft. Etwa alle hundert 
Kilometer m&uuml;ssen Repeaterstationen stehen, die mit optischen Faserverst&auml;rkern 
ausgestattet sind. Je nach Bedarf wird bei dieser Gelegenheit auch noch eine Abzweigung 
eingerichtet, um regionale Kunden zu versorgen.
<p>
In nahezu jedem modernen Weitverkehrsnetz kommt als Transporttechnik in Europa die "Synchrone 
Digitale Hierarchie" (SDH) und in den USA der fast deckungsgleiche "Standard Synchronous 
Optical Network" (SONET) zum Einsatz. Mit einem Zeitmultiplexverfahren werden Nutzdaten 
in Transport-Container ("Synchrone Transport-Module", STM) verpackt und mit einem Header 
versehen. Jedes Paket hat je nach Streckenbandbreite eine bestimmte "Byte-Breite", dauert
aber stets 125 Nanosekunden.
<p>
SDH gestattet den Verkauf von Kapazit&auml;ten je nach Bandbreite. Im Angebot stehen 
beispielsweise STM-1 (155 MBit/s), STM-4 (622 MBit/s), STM-16 (2,5 GBit/s) und STM-64 (10 GBit/s). 
In den USA bietet der SONET-Standard die gleichen Geschwindigkeitsstufen unter anderen 
Bezeichnungen: Eine STM-4-Leitung entspricht in SONET einer OC-12-Verbindung ("OC = 
Optical Carrier"), STM-16 entspricht OC-48, usw. Diese Klassifizierung ist f&uuml;r 
die Provider wichtig. Inoffiziell teilen sich die Unternehmen in "Tier"-Klassen ein 
(englisch "tier" = Stufe, Rang). "Tier 1" bedeutet &uuml;ber weite Strecken mindestens 
STM-16, ein autonomes System mit nationaler oder globaler Ausdehnung und rege Beziehungen 
zu anderen Carriern. "Tier-2"-Anbieter sind deutlich kleiner, und "Tier-3"-Provider verf&uuml;gen 
&uuml;ber ein lokal beschr&auml;nktes Glasfasernetz.
<p>
Der Betrieb von Austauschknoten oder Transitpunkten benötigt Hardware und Wartung. 
Daher haben sich weltweit einige gro&szlig;e &ouml;ffentliche Knoten etabliert. Europas  
gr&ouml;&szlig;ter Knoten ist der "London Internet Exchange"(LINX). An den Knoten k&ouml;nnen 
die Provider ihre Daten kostenneutral von einem Netz ins andere leiten ("Commercial Internet 
Exchange", CIX). Sie sorgen dabei selbst f&uuml;r die Zuf&uuml;hrung zum CIX und die Kosten. 
National existieren kleinere Knoten, in Deutschland beispielsweise der INXS in M&uuml;nchen, 
der BCIX in Berlin und der HHCIX in Hamburg sowie der internationam bedeutende DeCIX in Frankfurt
(betrieben vom Provider-Verband eco). 141 Carrier und Provider sind dort derzeit angebunden. 
<P>
<center><img src="images/bw_cix.jpg"></center><br>
<small>IP-Routen zwischen London, Paris und Frankfurt</small>
<p>
Statistiken über die Datenmenge, die durch den DeCIX rauscht erhalten Sie unter
<A HREF="http://www.decix.com/info/traffic.html">http://www.decix.com/info/traffic.html</A>.
<P>

Weiterf&uuml;hrende Informationen zu diesem Thema:<br>
Roland Kiefer, Peter Winterling: Optische Netze, Technik, Trends und Perspektiven, c't 2/03, S. 152<br>
Holger Bleich, J&uuml;rgen Kuri, Petra Vogt: Zwischen Boom und Baustopp, Schweinezyklus beim 
Ausbau der Internet-Backbones, c't 21/03, S. 184<br>
Irene Heinen: Daten-Disponenten, Neue Internet-Knoten verk&uuml;rzen Wegstrecken auf dem 
Daten-Highway, c't 25/03, S. 92<br>
Holger Bleich: Bosse der Fasern, Die Infrastruktur des Internet, c't 07/05, S. 88
<P>

<H2><A NAME="10.2">Voice over IP</A></H2>
Der klassische Telefondienst wird heute im Fernbereich, Mobilkommunikation sogar 
generell &uuml;ber digitale Paketvermittlungsnetzwerke (ATM, Frame-Relay etc.) abgewickelt,
auch wenn er nat&uuml;rlich weiterhin leitungsvermittelt zu sein scheint. Die Konvergenz 
von Internet und Telekommunikation ist ein Trend von erheblicher Bedeutung f&uuml;r 
die gesamte Informatik.
Unternehmen mit eigenen Computernetzen und/oder festen Internet-Anschl&uuml;ssen 
gehen deshalb dazu &uuml;ber, die TCP/IP-Netze auch zur internen bzw. externen 
Sprachkommunikation zu nutzen. Die verwendeten Protokolle in der Anwendungsschicht 
werden unter dem Oberbegriff "Voice-over-IP" (VoIP) zusammengefasst.
Durch "Internet-Telefon-Gateways" l&auml;&szlig;t sich das klassische Telefonnetz mit dem
IP-Netz verbinden, so da&szlig; von Telefon zu Telefon &uuml;ber das Internet telefoniert 
werden kann.
<P>
<center><img src="images/voip1.gif"></center>
<P>
Bekanntester, aber wenig popul&auml;rer Ableger ist die Internet-Telefonie. Zwar 
l&auml;&szlig;t sich damit billig mit Gespr&auml;chspartnern in der ganzen Welt 
telefonieren, dies m&uuml;ssen lediglich ebenfalls &uuml;ber ein Internet-Telefon 
oder die entsprechende Software verf&uuml;gen. Aber da der Datenstrom im Internet 
unberechenbar ist und es keine Zustellgarantie f&uuml;r Datenpakete gibt, leidet die 
Sprachqualit&auml;t.
Im eigenen Firmennetz hingegen lassen sich Netzlast, Traffic, Laufzeiten und 
Verbindungswege kontrollieren. Das &auml;ndert zwar nichts daran, da&szlig; 
IP an sich ausschlie&szlig;lich zur Daten&uuml;bertragung entwickelt wurde. 
Das IP-Protokoll ist aber wesentlich flexibler, als es ihm viele zutrauen.
<P>
Firmen k&ouml;nnen Ihren gesamten internen Telefonverkehr &uuml;ber ihr Intranet kostenlos
abwickeln. Privatanwendern und Firmen erschlie&szlig;en sich Kostenersparnisse bei
Telefonaten ins Ausland oder zum Mobilfunknetz.
Voice over IP stellt die erste Stufe der Konvergenz von Daten und Sprache dar. 
Die Sprachintegration auf der flexibleren EDV-Infrastruktur auf der Basis von 
IP bietet sich an. Die Schritte zur integrierten Telefonie bzw. der vollst&auml;ndigen 
Vereinigung der Kommunikationsplattformen sind:
<ol>
<li>Gemeinsame Infrastruktur<br>
In die Telefonapparate werden Netzwerk-Schnittstellen eingebaut. Das Telefon ist somit 
in die gleichen Services- bzw. Netzumgebung eingebunden wie der PC
<li>Gemeinsames Management<br>
Die Funktionen der Telefonzentrale werden auf einem PC-Server integriert. Die 
Verbindung ins &ouml;ffentliche Telefonnetz erfolgt via Router. Die Sprache wird auf 
dem Firmennetz gegen&uuml;ber dem Datenverkehr privilegiert.
<li>Gemeinsame Anwendungen<br>
Die Interaktion zwischen Daten und Sprache ist nun m&ouml;glich: Eine Telefonnummer
kann mit einer Produkt- oder Kunden-Nummer oder einer Homepage verkn&uuml;pft 
werden etc.
<li>Mehrwertdienste<br>
Die Internet-Telefonie bietet zus&auml;tzliche Leistungsmerkmale bei PC-Nutzung z. B. 
Video&uuml;bertragung, Whiteboard oder gemeinsames Bearbeiten von Dokumenten.
</OL>
<p>
Bei geringeren Kosten bietet die integrierte Telefonie bessere Leistung und ist 
bereits sehr stark auf die kommenden Gesch&auml;ftsanwendungen ausgerichtet.
Die Vorteile sind u. a.:
<ul>
<li>Mit dem Zusammenlegen der Infrastruktur und dem Management verringern sich 
nicht nur die Investitionskosten (nur eine Verkabelung, nur ein Kommunikationsanschluss 
pro Arbeitsplatz), sondern insbesondere auch die Betriebskosten. Der Unterhalt und 
Betrieb eines einzigen Service f&uuml;r Sprache und Daten auf einer einzigen 
Kommunikationsinfrastruktur schl&auml;gt gegen&uuml;ber zwei getrennten Systemen 
positiv zu Buche.
<li>Die lokale Telefonie innerhalb eines Netzwerkes ist gratis. Die Infrastruktur 
stellt einen lokalen Telefonanbieter dar; es fallen f&uuml;r lokale Gespr&auml;che 
keine Kosten bei einem externen Carrier an.
<li>Die Auslastung des bestehenden Netzwerkes wird optimiert. Die LAN-Architektur 
bietet gr&ouml;sstm&ouml;gliche Flexibilit&auml;t f&uuml;r Anpassungen an die 
Unternehmensstruktur.
</UL>
<P>
<center><img src="images/voip2.gif"></center>
<P>
Zu einem kompletten Voice-over-IP-System geh&ouml;rt zun&auml;chst einmal eine
TK-Anlage auf Softwarebasis. Als Kommunikationszentrale verwaltet sie die
Berechtigungen und Profile der Nutzer. Sie stellt Verbindungen her und sorgt
f&uuml;r die richtige Zuordnung, ohne da&szlig; die eigentliche Kommunikation 
&uuml;ber sie l&auml;uft. Der IP-Gateway ist der Mittler zwischen IP-Telefonie 
und der bisher genutzten Telefontechnologie wie etwa ISDN. 
Am Ende der Leitung im VoIP-Netz steht entweder ein IP-Telefon oder ein Computer 
mit Sound-Karte und IP-Telefonie-Software. F&uuml;r die Sprachein- und -ausgabe 
wird ein Headset verwendet. Herk&ouml;mmliche Telefone lassen sich aber
mit einer Adapterkarte ebenso computertauglich anschlie&szlig;en.
<p>
Bei Datenpaketen kommt es nicht so sehr darauf an, in welcher Reihenfolge und 
mit welcher Verz&ouml;gerung sie &uuml;bertragen werden. Der Empf&auml;nger 
speichert die eingehenden Pakete und setzt sie wieder in der richtigen Reihenfolge 
zusammen. Wird ein Paket besch&auml;digt oder geht verloren, wird es erneut 
gesendet.<BR>
Das funktioniert nicht bei zeitsynchronen Daten wie Sprache oder Video. Deshalb 
wurden im neuen IP-Standard, IPv6, zwei neue Sub-Standards implementiert: 
das Reservation Protocol (RSVP) und das Realtime Transport Protocol (RTP). 
RSVP erlaubt zwei Endpunkten einer Verbindung, bestimmte Parameter auszuhandeln, 
darunter eine maximale Verz&ouml;gerung (Delay) und einen minimalen Durchsatz. 
Das IP-Netz garantiert mittels verschiedener Verfahren, da&szlig; diese als 
"Flowspec" bezeichneten Quality of Service (QoS) eingehalten werden.
<P>
<center><img src="images/voip3.gif"></center>
<P>
Am sichersten funktioniert das unter Verwendung des "Guaranteed-Service"-Verfahrens. 
Hierbei wird anderer Traffic im Netz unterbunden, sobald dieser die Flowspec 
gef&auml;hrden k&ouml;nnte. Diesem starren, aber effizienten Verfahren steht 
"Controlled Load" gegen&uuml;ber. Hierbei d&uuml;rfen auch andere Stationen 
IP-Pakete solange senden, wie eine mittels Flowspec ausgehandelte Verbindung 
keine Beeintr&auml;chtigung in den vorgegebenen Parametern feststellt.
"Controlled Load" bietet also mehr Dynamik und lastet das IP-Netz insgesamt besser 
aus. Ein Vorurteil ist, da&szlig; f&uuml;r Voice over IP Anwendungen bestimmte 
IP-Pakete mit Sprachdaten mittels RSVP priorisiert werden. Das stimmt nicht.
RSVP dient nur zum Aushandeln und &Uuml;berwachen der Verbindungsparameter. 
IP-Sprachpakete werden zwar in den meisten IP-Netzen von Routern und Switches 
vorrangig behandelt, allerdings ist diese Priorisierung meist herstellerabh&auml;ngig 
und somit propriet&auml;r. Das birgt Probleme, wenn Netzkomponenten unterschiedlicher 
Hersteller im IP-LAN Voice-Daten transportieren soll.
<p>
Dem soll RTP entgegenwirken. Jedes IP-Paket erh&auml;lt seit IP 6 zus&auml;tzlich einen 
Zeitstempel (Time Stamp) mit der Entstehungszeit sowie eine Folgenummer (Sequence 
Information). Dies erlaubt es dem Empf&auml;nger, Pakete nicht nur in richtiger 
Reihenfolge, sondern auch zeitsynchron zusammenzusetzen. Das Real Time Control Protocol 
(RTCP) koordiniert zudem Sender- und Empf&auml;ngerprotokolle und sorgt f&uuml;r 
Monitoring und Management von Echtzeitverbindungen.<BR>
Au&szlig;erdem definiert RTP die Kodierung von Audiosignalen nach G.711 sowie 
G.723. Hierbei handelt es sich um Codecs (Coding/Decoding), die von der ITU zur 
analogen und digitalen Verschl&uuml;sselung von Sprache in Telefonnetzen 
definiert wurden. G.711 entspricht in etwa dem ISDN-Standard, Sprachdaten werden 
mit einem Datenstrom von 64 kbit pro Sekunde &uuml;bertragen.
<P>
F&uuml;r Voice over IP kommt G.711 jedoch nicht zum Einsatz, da sich die Datenlast durch 
zus&auml;tzliche Komprimierung und bessere Abtastverfahren auf bis zu 9,6 kbps dr&uuml;cken 
l&auml;&szlig;t (dies entspricht dem GSM-Standard). Verbreitet ist vor allem das 
CELP-Verfahren (Codebook Excited Linear Predictive Coding), das mit einem komplizierten 
mathematischen Modell der menschlichen Sprache arbeitet. Als Ergebnis entsteht ein 
Datenstrom von 16 kbit pro Sekunde, der Telefonate in ISDN-Sprachqualit&auml;t 
&uuml;bertr&auml;gt.<br>
Kombiniert mit Dualrate Speech Coding, definiert im G.723-Standard, gen&uuml;gt sogar 
ein Datenstrom von nur 5,3 kbps. Au&szlig;er der geringeren Netzlast bringt dies den 
Vorteil, da&szlig; sich mehr Pakete puffern lassen, ohne die Echtzeitbedingung zu 
gef&auml;hrden. Die Qualit&auml;t der Sprach&uuml;bertragung im IP-Netz gewinnt 
also, je kleiner die Datenrate f&uuml;r einen Sprachkanal ist.
<p>
Ein weiterer wichtiger Standard f&uuml;r Voice over IP kommt vom Videoconferencing. 
H.323 umfa&szlig;t sowohl eine Codec-Technologie (wie G.723) wie auch die Signalisierung 
und Verbindungssteuerung f&uuml;r Videokonferenzsysteme.
F&uuml;r IP-Telefonie wurden Teile des H.323-Standards &uuml;bernommen. &Uuml;ber eine 
TCP-Verbindung wird zwischen Sender und Empf&auml;nger das Signalisierungsprotokoll 
H.245 ausgehandelt. Dies zeigt eingehende Rufe an und &uuml;bermittelt Statusinformationen. 
Die Daten&uuml;bertragung selbst erfolgt &uuml;ber UDP. TCP-Pakete werden dadurch bei 
jedem Hop auf Fehler kontrolliert und gegebenenfalls korrigiert beziehungsweise 
zur&uuml;ckgewiesen. UDP l&auml;&szlig;t diese Kontrolle aus, UDP-Pakete erreichen den 
Empf&auml;nger also schneller. Daf&uuml;r mu&szlig; der sich selbst um Fehlerkorrektur 
bem&uuml;hen. Voice over IP kodiert hierzu entweder im selben Paket oder im Folgepaket 
Redundanz, aus der sich ein besch&auml;digtes Paket beim Empf&auml;nger reparieren 
l&auml;&szlig;t, womit ein erneutes Senden defekter IP-Pakete vermieden wird.
Zus&auml;tzlich erfolgt die Verbindungssteuerung einer Sprach&uuml;bertragung im IP-Netz 
gem&auml;&szlig; H.323 mit einem Q.931-konformen Signalisierungskanal. Dieser steuert die 
Sprachverbindung und ist f&uuml;r Funktionen wie etwa Makeln oder 
Rufnummern&uuml;bermittlung zust&auml;ndig.
<p>
Um Voice over IP im LAN einzuf&uuml;hren, m&uuml;ssen s&auml;mtliche Switches und Router 
die entsprechenden Protokolle von IPv6 auf dem ISO/OSI-Level 3 unterst&uuml;tzen. 
Wichtig sind vor allem die Verarbeitung von RTP sowie die Unterst&uuml;tzung von RSVP. 
F&uuml;r Konferenzen und Videodaten (die mittels der selben Verfahren wie Sprache 
&uuml;bertragen werden), wird au&szlig;erdem das relativ neue IP-Multicast genutzt. 
Dabei kopiert eine Netzkomponente einen eingehenden Datenstrom eigenst&auml;ndig und 
sendet ihn an alle Empf&auml;nger weiter. Dies vermeidet zus&auml;tzliche Datenkan&auml;le 
zwischen dem Ursprung der &Uuml;bertragung und jedem Empf&auml;nger. Statt dessen wird 
der Datenflu&szlig; an beliebiger Stelle im Netz dupliziert.
<p>
Mittlerweile gibt es erste Ethernet-Telefone. Diese werden statt an eine Telefondose an 
eine RJ-45-Buchse eines Ethernet-Hubs angeschlossen. Alternative hierzu bieten sich CTI 
oder Wandlerkarten an. Auch etliche DSL-Router erm&ouml;glichen den Anschlu&szlig;
von herk&ouml;mmlichen Analogtelefonen oder dienen sogar als Telefonanlage. Aber auch
die Telefonie direkt am PC mit einem Headset und passender Software ist m&ouml;glich
(sogenanntes Softphone).
<p>
VoIP läuft so zuverl&auml;ssig wie die Internetverbindung selbst. Generell besteht damit 
kein Unterschied zur Festnetzanschluss. Auch k&ouml;nnen Gespr&auml;che in die Fest- 
und Mobilfunknetz gef&uuml;hrt und entgegengenommen werden. Dazu erhalten Nutzer beim 
VoIP-Provider kostenlos ihre Ortsrufnummer, der auch die Notrufe 110 und 112 bereitstellt. 
<P>
Bei Voice-over-IP (VoIP) bestehen Sicherheitsm&auml;ngel, die sich aus der Internetnutzung 
ergeben. Telefonate von VoIP-Nutzern lassen sich innerhalb lokaler Netze mit Hilfe von 
Software-Tools (Paket Sniffern) abh&ouml;ren und Rufnummern ausspionieren. 
VoIP-Adapter und -Telefone sind empfindlich gegen&uuml;ber Hacker-Attacken, insbesindere
Denial-of-Service-Angriffen. Generell sollte auch die Konfigurationsoberfl&auml;che der 
VoIP-Hardware durch ein Passwort gesch&uuml;tzt werden. Eindringlinge k&ouml;nnten sonst 
bestehende Guthaben abtelefonieren und eingehende Anrufe entgegennehmen.
<P>
Im Gegensatz zur SPAM-Problematik bei E-Mail ist unerw&uuml;nschte Werbung &uuml;ber 
VoIP, sogenannter SPIT, derzeit noch kein Problem. Gegen&uuml;ber E-Mail ist der VoIP-Bereich 
nicht offen zug&auml;nglich, sondern abgeschottet. Realisiert wird dies durch die genaue 
Zuordnung der VoIP-Rufnummern. Jeder Nutzer ist damit dem VoIP-Provider bekannt. Anrufe, 
die au&szlig;erhalb dieser vertrauensw&uuml;rdigen Netze initiiert werden, sind nicht 
kostenlos und deshalb uninteressant f&uuml;r SPITTER. Ein Problem stellt die Signalisierung
zwischen den einzelnen Telefonanbietern dar, die gewisserma&szlig;en "auf Vertrauensbasis"
abl&auml;ft. &Uuml;berwindet ein Hacker die Signalisierungsprotokolle, kann er so ziemlich
alles machen was er will.
<P>


<H2><A NAME="10.3">Powerline Communications</A></H2>
<H4>die Stromleitung ist das Netzwerk</H4>
Powerline Communications erlaubt die Obertragung von Daten mit Geschwindigkeiten 
von mehr als einem Mbit/s bis zum Endbenutzer &uuml;ber das Niederspannungs-Energieverteilnetz. 
Mit dieser &Uuml;bertragungstechnik wird eine echte Alternative f&uuml;r die sogenannte 
"Letzte Meile" geschaffen. Mit der Powerline Communications Systeml&ouml;sung 
von Siemens k&ouml;nnen Energieversorgungsunternehmen (EVU) und Stadtwerke vor 
allem den privaten Stromkunden neue Dienste wie beispielsweise "Internet aus 
der Steckdose" sowie Energie- und Mehrwertdienste auf eigener Infrastruktur 
anbieten. Das Stromverteilnetz ist die weltweit gr&ouml;&szlig;te fl&auml;chendeckende 
Kabelinfrastruktur bis in jeden Haushalt. Die bisher ausschlie&szlig;lich f&uuml;r 
die Energieversorgung genutzte Verkabelung ist im deregulierten Telekommunikationsmarkt 
der Schl&uuml;ssel f&uuml;r den direkten Zugang zum privaten Kunden. Die EVUs k&ouml;nnen 
ihr existierendes Stromnetz f&uuml;r neue Dienstangebote nutzen und sich dadurch 
neue Einnahmequellen erschlie&szlig;en. Auf Basis der PLC Kommunikationsinfrastruktur 
werden EVUs weitere Anwendungen zur Effizienzsteigerung (z.B. Lastmanagement) 
und zus&auml;tzliche Dienste (z.B. Security, Fern&uuml;berwachung) entwickeln und 
so ihre Wettbewerbsposition in deregulierten Energiem&auml;rkten verbessern. 
Im Unterschied zu anderen L&ouml;sungsans&auml;tzen erm&ouml;glicht die Powerline 
Communications L&ouml;sung von Siemens die Nutzung des Niederspannungsnetzes bis 
zur Steckdose im Haushalt. &Uuml;ber das Stromnetz k&ouml;nnen zus&auml;tzlich zur 
Energie gleichzeitig Daten und Sprache &uuml;bertragen werden. Bitraten von mehr 
als einem Mbit/s machen aus jeder Steckdose einen leistungsf&auml;higen Kommunikationsanschlu&szlig;. 
In die L&ouml;sung ist ein intelligentes Bandbreitenmanagement implementiert, das 
erm&ouml;glicht, den Benutzern je nach Bedarf Bandbreite zur Verf&uuml;gung zu stellen. 
Siemens entwickelte f&uuml;r Powerline Communications ein neues, f&uuml;r das besondere 
&Uuml;bertragungsverhalten des Stromnetzes optimiertes &Uuml;bertragungsverfahren. 
Das Verfahren (Orthogonal Frequency Division Multiplexing, OFDM) erm&ouml;glicht 
hohe Datenraten selbst bei starken St&ouml;rungen auf dem Energienetz.  
Die Siemens AG, Bereich Information and Communication Networks und der Schweizer 
Hersteller von Telekommunikationsausr&uuml;stung Ascom wollen die Entwicklung der 
breitbandigen Powerline Communications (PLC)-Technik f&uuml;r den Einsatz auf dem 
Niederspannungsnetz gemeinsam weiter vorantreiben. Beide Unternehmen f&uuml;hren 
Gespr&auml;che, um offene Fragen f&uuml;r die Regulierung zu kl&auml;ren und Spezifikationen 
f&uuml;r gemeinsame Schnittstellen zu erstellen. Heute gibt es bereits erste Feldversuche 
und Labormuster f&uuml;r die neue Technik. Aus Kundensicht sind die derzeit auf 
dem Markt angebotenen propriet&auml;ren L&ouml;sungen jedoch nicht zufriedenstellend. 
Denn ein breiter Einsatz dieser PLC-Technik wird heute weniger durch den noch 
fr&uuml;hen Entwicklungsstand, als durch die nicht vorhandene Kompatibilit&auml;t 
der L&ouml;sungen behindert.
<P>

<H4>HomePlug: PC-Vernetzung &uuml;ber die Stromleitung</H4>
"Power-Line-Communications" ist dezeit relativ tot, aber seit 2002 gibt es
etwas Neues, die "Home-Plug-Technologie" wieder. Mit der Powerline-Technologie 
hat Home-Plug wenig zu tun. Jedoch haben die technischen Grundprinzipien 
eine neue und sinnvole Anwendung gefunden: Rechner &uuml;ber existierende 
230-V-Leitungen im Haus miteinander zu vernetzen. Etliche Unternehmen bieten 
entsprechende Adapter an, die alle &auml;hnlich arbeiten. Bei der Develo AG 
hei&szlig;t  das Teil "Micro-Link-DLAN" und sieht aus wie ein Steckernetzteil.
Die Home-Plug-Technologie nutzt die bestehenden 230-V-Leitungen im Haus f&uuml;r 
die Daten&uuml;bertragung. 
<P>
<CENTER><img src="images/dlan.jpg"></CENTER>
<P>
Mit einer maximalen Daten&uuml;bertragungsrate von 14 Mbit/s und synchronem Up-
und Download ist Home-Plug auch recht flott. In der Praxis lassen sich - je nach
Leitungsqualit&auml;t - Bandbreiten zwischen 5 Mbit/s und 7 Mbit/s gew&auml;hrleisten,
was z. B.f&uuml;r die Verl&auml;ngerung des DSL-Anschlusses in jedes Zimmer eines 
Hauses v&ouml;llig ausreicht. Je nach D&auml;mpfungsfaktor der Elektroinstallation 
lassen sich mit MicrolinkDLAN (Direct-LAN) Entfernungen bis 200 m &uuml;berbr&uuml;cken 
und beliebig viele Computer anschlie&szlig;en. Zus&auml;tzliche Ger&auml;te sind nicht 
notwendig, da die Phasenkopplung durch ein "&Uuml;bersprechen" stattfindet.
Die Installation der DLAN-Komponenten gestaltet sich einfach: &Uuml;ber den DLAN-Adapter 
verbindet man eine Netzkomponente an die n&auml;chstgelegene Steckdose, und sofort 
l&auml;sst sich jede andere beliebige Stromsteckdose im Haus als Netzwerkzugang verwenden.
Ein Ethernet- oder ein USB-Kabel - je nach Modell - koppelt den PC an einen weiteren 
Micro-Link-DLAN-Adapter, dessen Stecker die Verbindung zum Heimnetz herstellt.
Auf Grund automatischen Frequenzwechsels unterdr&uuml;ckt das System Einfl&uuml;sse 
in der Daten&uuml;bertragung durch aktive und St&ouml;rungen ins Stromnetz sendende 
Haushaltsger&auml;te wie Waschmaschinen oder K&uuml;hlschr&auml;nke. 
Im Unterschied zu drahtlosen Funknetzen wirkt bei HomePlug der Stromz&auml;hler im Haus 
als Sperre gegen unerw&uuml;nschten Zugriff von au&szlig;en (Signal wird stark ged&auml;pft). 
Zus&auml;tzliche Sicherheit bietet eine leistungsf&auml;hige DES-Verschl&uuml;sselung 
(Datenverschl&uuml;sselung in &Uuml;bertragungssystemen).
<P>
Die Ger&auml;te sind kompatibel zum Home-Plug-Standard 1.0. Im vergangenen Jahr verabschiedete 
die Home-Plug-Powerline-Alliance diesen Standard, zu deren weltweit &uuml;ber 100 Mitgliedern 
unter anderem Compaq, Intel, Motorola, AMD, Cisco Systems, 3Com, Panasonic und Texas Instruments 
geh&ouml;ren. Die von der DLAN-Technik verwendeten Frequenzen liegen im Bereich von 4 MHz
bis 21 MHz, somit werden die Rundfunkb&auml;nder nicht gest&ouml;rt (520 kHz bis 1605 kHz =
Mittelwelle; 150 kHz bis 285 kHz = Langwelle; 87,20 MHz bis 108,00 MHz = UKW). Die Technik 
basiert auf dem Home-Plug-Standard, in dem die Sendepegel speziell in einigen Amateurfunkb&auml;ndern 
abgesenkt sind. "Abgesenkt" hei&szlig; aber, da&szlig; das Signal ist in der N&auml;he 
durchaus noch feststellbar ist, teilweise sogar in st&ouml;render St&auml;rke. &Uuml;brigens betrifft 
die Absenkung nur die klassischen KW-Amateurfunk-B&auml;nder 40m, 20m und 15m. Die seit einigen 
Jahren im Bereich 4 bis 21 MHz zus&auml;tzlich erlaubten Bl&ouml;cke (30m und 17m) sehen keine 
Absenkung. Wenn sich DRM (www.drm.org) weiter ausbreitet, d&uuml;rften sich auch die neuen 
Kurzwellendigitalrundfunkh&ouml;rer &uuml;ber PLC &auml;rgern - ebenso die Minderheit der
Fernempfangsfreaks.
<BR>
Obwohl Home-Plug von der Leistungsf&auml;higkeit herk&ouml;mmlicher Ethernet-Verbindungen noch 
ein gutes St&uuml;ck entfernt ist, stellt es f&uuml;r viele Gebiete eine interessante Alternative 
dar. Auch gegen&uuml;ber Wireless-LAN bietet diese Technologie einige Vorteile. In der Praxis 
h&auml;ngt die erreichbare &Uuml;bertragungsgeschwindigkeit allerdings vom Zustand der 
Elektroinstallation im Haus und der Ausstattung der Steckdosen ab. Hier ist dann
das Know-how des Elektroinstallateurs gefragt.
<P>

<H2><A NAME="10.4">Funk-LAN-Technologie</A></H2>
Die M&ouml;glichkeit, Computer drahtlos zu vernetzen, ist auf den
ersten Blick verlockend, konnte sich aber im Vergleich zu
kabelgebundenen L&ouml;sungen bisher nur f&uuml;r einige Spezialaufgaben
durchsetzen. Das hat vor allem folgende Gr&uuml;nde:
<ul>
    <li>Drahtlose Netzwerk-Adapter sind erheblich langsamer als
        herk&ouml;mmliche Netzwerkkarten. Selten wird eine
        Geschwindigkeit von mehr als 22 MBit/s erreicht, meist
        erheblich weniger.
    <li>Innerhalb der Reichweite (je nach Geb&auml;udestruktur etwa
        10...50 m) teilen sich die drahtlos vernetzten Computer
        die &Uuml;bertragungsleistung. Die Netto-Geschwindigkeit
        sinkt dadurch weiter.
    <li>Die Kosten f&uuml;r drahtlose Adapter liegen 
        &uuml;ber jenen f&uuml;r konventionelle 10-MBit/s-Netzwerkkarten.
    <li>Bei den meisten L&ouml;sungen sind zus&auml;tzliche teure
        "Access Points" n&ouml;tig, die die Schnittstelle
        zwischen einem Kabel-Netzwerk und drahtlosen Workstations
        darstellen.
</ul>
<p>
Die ersten "Radio LANs" arbeiteten &uuml;berwiegend mit dem 
gegen&uuml;ber St&ouml;rungen relativ unempfindlichen Spread-Spectrum-Verfahren, 
bei dem die Daten auf viele Tr&auml;gerfrequenzen verteilt werden, typisch auf einen
Bereich von 20 MHz bei einer Datenrate von 2 MBit/s. Das Spreizen des Signals erfolgte 
entweder mit dem Zufallssystem Direct Sequence Spread Spectrum (DSSS) oder durch das 
zyklische Springen zwischen mehreren Frequenzb&auml;ndern (FHSS, Frequency Hopping Spread
Spectrum). Sicherheitshalber werden die Daten verschl&uuml;sselt.
<p>
Technisch entsprechen diese Netze einem Bus-System ohne Kabel oder die
Schnurlos-Stationen bilden zusammen eine Bridge. Seit 1997 werden Funk-LANs mit 1 
oder 2 MBit/s im 2,4-GHz-Bereich mit der Norm IEEE 802.11 standardisiert. Als 
Sendeleistung ist maximal 1 Watt vorgesehen. Die Reichweite innerhalb von Geb&auml;uden
betr&auml;gt etwa 50 m, au&szlig;erhalb davon einige hundert Meter. Neuere
Entwicklungen erreichen bei 19 GHz bis zu 10 MBit/s, allerdings
bei deutlich kleinerer Reichweite.
<P>
<center><img src="images/funklan1.gif"></center>
<P>
Mit IEEE 802.11 (Teil der Standardisierungsbem&uuml;hungen des IEEE-802-Komitees, 
zust&auml;ndig f&uuml;r lokale Netzwerktechnologien) ist 1997 ein erster Standard f&uuml;r 
Funk-LAN-Produkte geschaffen worden. Mitte 1997 wurde der erste IEEE-802.11-Standard 
(2 Mbit/s Funk-LAN-Technologie) ver&ouml;ffentlicht, welcher dann, im Oktober 1999, mit 
IEEE 802.11b (High Rate) um einen Standard f&uuml;r 11-Mbit/s-Technologie erweitert 
wurde. Der IEEE-802.11-Standard beschreibt die &Uuml;bertragungsprotokolle bzw. Verfahren 
f&uuml;r zwei unterschiedliche Arten, Funk-Netzwerke zu betreiben. 
<P>
Der 802.11-Standard basiert auf CSMA/CA (Carrier Sense Multiple Access 
with Collision Avoidance). Der WLAN Standard ist &auml;hnlich aufgebaut wie der 
Ethernet-Standard 802.3 (CSMA/CD), versucht aber, Kollisionen zu 
minimieren. Der Grund liegt darin, da&szlig; z.B. zwei mobile Einheiten zwar von einem Access
Point erreicht werden, sich aber gegenseitig nicht "h&ouml;ren". Damit kann die 
wirkliche Verf&uuml;gbarkeit des Access Points nicht in jedem Fall erkannt werden.
<P>
<center><img src="images/csmaca.gif"></center>
<P>
Wie bei CSMA/CD h&ouml;ren alle teilnehmenden Stationen den Verkehr auf dem 
Funkkanal mit. Wenn eine Station &uuml;bertragen will, wartet sie, bis das Medium 
frei ist. Danach wartet sie noch eine vorbestimmte Zeitperiode (DIFS) plus einer 
zuf&auml;llig gew&auml;hlten Zeitspanne, bevor sie ihren Frame &uuml;bertragen will. Auch in 
dieser Zeitspanne (Wettbewerbsfenster) wird der Funkkanal weiter &uuml;berwacht. Wenn 
keine andere Station innerhalb des Wettbewerbsfensters vor dem gew&auml;hlten Zeitpunkt
mit der &Uuml;bertragung beginnt, sendet die Station ihren Frame. Hat aber eine andere 
Station innerhalb der Wartezeit mit der &Uuml;bertragung begonnen, wird der Zeitz&auml;hler 
angehalten und nach der &Uuml;bertragung der anderen Station weiter benutzt. Auf diese 
Weise gewinnen Stationen, die nicht &uuml;bertragen durften, an Priorit&auml;t und kommen 
mit einer erh&ouml;hten Wahrscheinlichkeit in den n&auml;chsten Wettbewerbsfenstern zum Zug. 
Eine Kollision kann nur entstehen, wenn zwei oder mehrere Stationen den gleichen 
Zeitslot ausw&auml;hlen. Diese Stationen m&uuml;ssen die Wettbewerbsprozedur erneut 
durchlaufen. 
<P>

<h3>Funknetz-Szenarien</h3>
Das erste Funk-Netz-Szenario 
beschreibt die Kommunikation in einfachen "<b>Ad-hoc</b>"-Netzwerken. Hierbei sind mehrere 
Arbeitsrechner in einem begrenzten Sendebereich miteinander verbunden. Zentrale 
&Uuml;bermittlungs- bzw. Kontrollsysteme, sogenannte "Access-Points" sind bei diesem 
Anwendungsfall nicht vorgesehen. Ein derartiges "Ad-hoc" Netzwerk k&ouml;nnte zum 
Beispiel zwischen den tragbaren Computersystemen w&auml;hrend einer Besprechung in 
einem Konferenzraum aufgebaut werden.
<P>
Im zweiten Anwendungsfall, dem sogenannten "<b>Infratruktur-Modus</b>", kommen 
"Access-Points" zum Einsatz. Bei diesen Ger&auml;ten handelt es sich 
um Netzwerkkomponenten, welche die Kommunikation innerhalb eines Funk-LANs, zwischen 
einzelnen Funk-LAN-Zellen und die Verbindung zwischen Funk-LANs und herk&ouml;mmlichen 
LANs (Kabel basierend) erm&ouml;glichen und kontrollieren. Access-Points regeln die 
"gerechte" Verteilung der zur Verf&uuml;gung stehenden &Uuml;bertragungszeit im 
Funk-Netzwerk. Des Weiteren erm&ouml;glichen diese Komponenten mobilen Arbeitsstationen 
das unterbrechungsfreie Wechseln (Roaming) von einer Funk-LAN-Zelle in die N&auml;chste.
<P>
<center><img src="images/funklan2.gif"></center>
<P>
Verschiedene Systeme k&ouml;nnen mittels einer speziellen Frequenzwahl bis zu acht
unterschiedliche Kan&auml;le im Frequenzband alternativ oder
teilweise auch gleichzeitig nutzen. Durch dieses Verfahren
k&ouml;nnen in bestimmten F&auml;llen z. B. auch durch
St&ouml;rungen belastete Frequenzen umgangen werden, um so die
&Uuml;bertragung zu sichern. Des weiteren k&ouml;nnen durch den
Einsatz mehrere Accesspoints parallele Funkzellen auf
unterschiedlichen Frequenzen aufgebaut werden und so die
Gesamt&uuml;bertragungskapazit&auml;t eines WLANs erweitern. Die
dadurch entstehende M&ouml;glichkeit unterschiedliche Frequenzen
zur Daten&uuml;bertragung mit getrennten Benutzergruppen zu nutzen,
kann den Datendurchsatz in einem solchen Funknetz vervielfachen, da
die einzelnen Frequenzsegmente jeweils die volle Bandbreite
f&uuml;r den Datenstrom zur Verf&uuml;gung stellen.
<P>
Eine wichtige Frage, die sich im Hinblick auf den Einsatz von Funk-Technologie immer 
wieder stellt, ist die m&ouml;gliche gegenseitige St&ouml;rung von elektronischen 
Ger&auml;ten (nicht nur von Funk-Sendern und Empf&auml;ngern). Oftmals werden sogar 
Bedenken zu einem m&ouml;glichen Gesundheitsrisiko durch die Nutzung von auf Funk 
basierenden Produkten ge&auml;u&szlig;ert.<BR>
Auf Funk basierende Ger&auml;te m&uuml;ssen einer Vielzahl von Standards und strengen 
gesetzlichen Richtlinien entsprechen, die sicherstellen, da&szlig; die Beeinflussung 
zwischen verschiedenen auf Funk basierenden 
Ger&auml;ten und auch anderen elektronischen Ger&auml;ten entweder unm&ouml;glich ist, 
oder die festgelegten Grenzwerte nicht &uuml;berschreiten, welche die internationalen 
und nationalen bzw. europ&auml;ischen Standardisierungs-Gremien festlegen.
<P>
Alle in Deutschland zugelassenen WLAN Systeme
benutzen ein offiziell f&uuml;r industrielle und andere Zwecke
reserviertes ISM-Frequenzband (<B>I</B>ndustrial <B>S</B>cientific
<B>M</B>edia) zwischen 2,400 und 2,483 GHz und &uuml;bertragen durch
Nutzung eines Teils der darin verf&uuml;gbaren Frequenzen mit
Datenraten von bis zu 11 Mbps (802.11b) oder 22 Mbps (802.11g). Der Standard
802.11a beschreibt Systeme, die im 5-GHz-Band betrieben werden und Brutto-Datenraten
bis zu 54 Mbps erm&ouml;glichen. Im 5-GHz-Band steht ein gr&ouml;&szlig;eres
Frequenzband zur Verf&uuml;gung - und damit mehr Kan&auml;le. Wichtig ist auch,
da&szlig; dieses Band ausschlie&szlig;lich f&uuml;r WLAN reserviert ist.
<P>
Die Kan&auml;le von 802.11b und ihre Frequenzen.
<p>
<ul><ul><table border=1 cellpadding=3 cellspacing=0>
    <tr><th width="25%">Kanal</td><th width="25%">Mittenfrequenz<br>(GHz)</td>
        <th width="25%">Kanal</td><th width="25%">Mittenfrequenz<br>(GHz)</td></tr>
    <tr><td width="25%">1</td><td width="25%">2.412</td><td width="25%">8</td><td width="25%">2.447</td></tr>
    <tr><td width="25%">2</td><td width="25%">2.417</td><td width="25%">9</td><td width="25%">2.452</td></tr>
    <tr><td width="25%">3</td><td width="25%">2.422</td><td width="25%">10</td><td width="25%">2.457</td></tr>
    <tr><td width="25%">4</td><td width="25%">2.427</td><td width="25%">11</td><td width="25%">2.462</td></tr>
    <tr><td width="25%">5</td><td width="25%">2.432</td><td width="25%">12</td><td width="25%">2.467</td></tr>
    <tr><td width="25%">6</td><td width="25%">2.437</td><td width="25%">13</td><td width="25%">2.472</td></tr>
    <tr><td width="25%">7</td><td width="25%">2.442</td><td width="25%">14</td><td width="25%">2.484</td></tr>
    </table></ul>
<p>
<ul>
<li>Die Abstufung erfolgt in 5 MHz Schritten (ausgenommen Kanal 14).
<li>In den USA sind die Kan&auml;le 1 - 11 verf&uuml;gbar.
<li>In Europa sind die Kan&auml;le 1 - 13 verf&uuml;gbar.
<li>In Frankreich sind die Kan&auml;le 10 - 13 verf&uuml;gbar.
<li>In Japan ist Kanal 14 verf&uuml;gbar.
</ul></ul>
<P>  
Da Funk-LAN-Produkte speziell f&uuml;r den Einsatz in B&uuml;ros und 
anderen Arbeitsumgebungen entwickelt wurden, senden sie auch mit einer entsprechend 
niedrigen, gesundheitlich unbedenklichen Leistung. Diese Leistung liegt unter einem 
maximalen Wert von 100 mW und damit z. B. signifikant unter der Sendeleistung von 
gebr&auml;uchlichen GSM Telefonen (ca. 2 W bei Ger&auml;ten GSM Klasse 4, d. h. 
Frequenzbereich 880-960 MHz). Erh&ouml;hte Gesundheitsrisiken konnten deshalb beim 
Umgang mit Funk-LANs im 2.4 GHz Frequenzband nicht festgestellt werden.
<P>
Die gr&ouml;&szlig;ten Bedenken gelten &uuml;blicherweise der Technologie Funk selbst. 
Aber unberechtigtes "Mith&ouml;ren" erweist sich in der Praxis sogar als wesentlich 
schwieriger und aufwendiger als bei herk&ouml;mmlichen auf Kupferkabeln basierenden 
Netzwerken. Sogenannte "Walls" sichern den Datenverkehr mittels eines
Verfahrens zur Bandspreizung (Spread-Spectrum, SS) gegen
Abh&ouml;ren und St&ouml;rungen, dieses Verfahren entspricht einer
komplexen Kodierung, die ein Abh&ouml;ren schon durch die
eingesetzten technischen Prinzipien sehr schwer macht. Alle z. Zt.
bekannten zugelassenen WLAN Systeme setzen zwei verschiedene
Techniken ein, das sogenannte Direct Sequence SS (DSSS) und das
Frequency Hopping SS (FHSS) Prinzip.
<P>
Direct Sequence SS verschl&uuml;sselt jedes Bit in
eine Bitfolge, den Chip, und sendet diesen auf das Frequenzband
aufgespreizt. F&uuml;r unbefugte Lauscher verschwindet das Signal
dadurch im Hintergrundrauschen, erst der autorisierte
Empf&auml;nger kann es wieder ausfiltern. Das DSSS System ist
unempfindlicher gegen St&ouml;rungen und hat sich als L&ouml;sung
mit den meisten installierten Ger&auml;ten in diesem Markt
durchgesetzt.
<P>
<center><img src="images/dsss.gif"></center>
<P>
Beim Frequence Hopping vereinbaren Sender und
Empf&auml;nger w&auml;hrend des Verbindungsaufbaus eine Folge, nach
der einige Male pro Sekunde die Sendefrequenz umgeschaltet wird.
Ein nicht autorisierter Zuh&ouml;rer kann diesen Spr&uuml;ngen
nicht folgen, die Synchronisation zwischen Sender und
Empf&auml;nger bedeutet jedoch zus&auml;tzlichen Ballast (Overhead)
in der Daten&uuml;bertragung.
<P>
<P>
<center><img src="images/fhss.gif"></center>
<P>
Um das komplette Signal erfolgreich empfangen und interpretieren zu 
k&ouml;nnen, mu&szlig; der Empf&auml;nger den korrekten Entschl&uuml;sselungsalgorithmus 
kennen. Daten w&auml;hrend der &Uuml;bertragung abzufangen und zu entschl&uuml;sseln 
wird dadurch recht schwierig. Die Sicherheit von Funk-LAN-Produkten beschr&auml;nkt sich 
selbstverst&auml;ndlich nicht nur auf die Wahl von DSSS als &Uuml;bertragungsverfahren. 
So sieht der IEEE-802.11-Standard optional auch verschiedene Methoden f&uuml;r 
Authentisierung und Verschl&uuml;sselung vor. Unter Authentisierung versteht man dabei 
all jene Mechanismen mit denen &uuml;berpr&uuml;ft bzw. kontrolliert wird, welche 
Verbindungen im Funk-LAN zul&auml;ssig sind. Mit der zus&auml;tzlichen 
Verschl&uuml;sselungstechnik WEP (Wired Equivalent Privacy), welche auf dem 
RC4-Verschl&uuml;sselungsalgorithmus basiert, wird ein Sicherheitsniveau erreicht, 
welches dem herk&ouml;mmlicher LAN-Technologien mehr als entspricht. Als weitere sehr 
flexible Sicherheitsfunktion, erweisen sich auch Filter auf MAC-Adress-Ebene, die im 
Access-Point konfiguriert werden k&ouml;nnen. &Uuml;ber diese Filter kann die 
Kommunikation &uuml;ber den Access-Point sehr wirkungsvoll gesteuert werden.
<P>
Funk-LAN-Technologie und -Produkte erg&auml;nzen in idealer Weise die "klassischen" 
LAN-L&ouml;sungen. 
Die Bandbreite wird jedoch dann zu einem entscheidenden Faktor beim Einsatz von 
Funk-LAN-Installationen, wenn eine gro&szlig;e Anzahl von Arbeitsstationen angebunden 
werden soll und der Einsatz sehr "bandbreitenintensiver" Multimedia-Anwendungen geplant 
ist. Man sollte nicht &uuml;bersehen, da&szlig; Funk-LAN-Technologie sich wie jedes 
andere "Shared-Medium" verh&auml;lt und damit sehr &auml;hnlich zu Ethernet-L&ouml;sungen ist.
<P>
Ein weiterer wichtiger, zu beachtender Aspekt bei Planung und Einsatz von 
Funk-LAN-L&ouml;sungen, liegt in den oftmals schwer einsch&auml;tzbaren 
Umgebungseinfl&uuml;ssen, welche die &Uuml;bertragungsqualit&auml;t und 
&Uuml;bertragungsreichweite vermindern k&ouml;nnen. So k&ouml;nnen Reichweite und 
Qualit&auml;t der &Uuml;bertragung nicht nur durch die Positionierung und Anordnung 
der Arbeitsstationen und Access-Points beeinflusst werden, sondern es entsteht auch 
eine, zum Teil gravierende, Beeintr&auml;chtigung durch die zu durchdringenden 
Hindernisse (Ziegelw&auml;nde, Stahlbeton, etc.). 
<P>
F&uuml;r die Realisierung eines Funk-Lan stehen zwei Betriebsarten zur Verf&uuml;gung:
<UL>
<LI>Im <B>Infrastructure Mode</B> hingegen vermittelt eine spezielle Basisstation, 
Access Point genannt, zwischen den Clients. Er dient zum einen als Bridge 
zum drahtgebundenen Netz, vermittelt also Pakete zwischen den Netzen hin 
und her. Zum anderen arbeitet ein Access Point als Repeater, das 
hei&szlig;t er empf&auml;ngt die Pakete der Stationen und leitet sie an 
andere weiter - dabei sinkt nat&uuml;rlich der Durchsatz. Letztlich kann 
ein Access Point die Reichweite verdoppeln, wenn er zentral aufgestellt 
ist: Er l&auml;sst zwei Stationen miteinander kommunizieren, die so weit 
voneinander entfernt stehen, da&szlig; sie sich im Ad-hoc-Modus nicht 
"sehen" k&ouml;nnten.
Bei der Raumabdeckung ist mit einem Radius von rund 50 Metern zu rechnen,
innerhalb dessen sich die mobilen Stationen um einen Access-Point bewegen
k&ouml;nnen. 
<LI>Im <b>Ad-hoc-Modus</b> 
kommunizieren die Stationen direkt miteinander. Im Grunde genommen handelt 
es sich um Punkt-zu-Punkt-Verbindungen, da aber jeder Rechner mehrere 
dieser Verbindungen unterhalten kann, spielt das praktisch keine Rolle. 
Mit einer Ausnahme: Es ist m&ouml;glich, da&szlig; weit voneinander entfernte 
Stationen einander nicht "sehen" k&ouml;nnen, beide sehr wohl 
aber eine dritte Station dazwischen. Der Ad-hoc-Modus ist letztlich am 
besten geeignet, wenn man gar kein gro&szlig;es Funknetz aufbauen will, 
sondern nur zwei Netze oder Systeme verbinden will.<br>
Der Ad-hoc-Modus hat aber Haken: Viele Hersteller haben dieser 
Betriebsart anfangs wenig Aufmerksamkeit gewidmet und statt der 
verabschiedeten Standards propriet&auml;re Verfahren implementiert. So 
kann es sein, da&szlig; die Karten zweier Hersteller im Ad-hoc-Modus 
nicht zueinander finden.
</uL>
Zur Inbetriebnahme eines Ad-hoc-Netzes mu&szlig; man auf allen Clients einen 
einheitlichen Namen f&uuml;r das Funknetz einstellen. Bei einem Netz mit 
Access Point reicht es hingegen, dort den gew&uuml;nschten Namen 
einzutragen; bei der Einstellung "any" auf den Clients erhalten 
diese automatisch den Namen &uuml;bermittelt. Unter Umst&auml;nden kann es 
im Ad-hoc-Netz Sinn machen, den Kanal vorzugeben, auf dem die Stationen 
funken sollen; im Normalfall finden sie aber selbstst&auml;ndig einen 
gemeinsamen Kanal. Eine gute Hilfestellung bietet die Software, die 
viele Hersteller ihren Funkkarten beilegen. 
<p>
<img src="images/funk-hard.jpg">
<br>
<H5>WLAN-MIni-PCI-Karte und Adapter f&uuml;r den PCI-Bus im PC.</H5>
<P>

<H3>Die Funk-LAN-Standards</H3>
Ein gravierender Nachteil der ersten WLAN-Standards ist die geringe Datenrate von 11 MBit/s.
Selbst bei guten Empfangsbedingungen ist nur etwa die H&auml;lfte f&uuml;r Nutzdaten
einsetzbar. Abhilfe versprach zun&auml;chst die Verdoppelung auf 22 MBit/s. Diese Erweiterung
war aber propriet&auml;r. IEEE 802.11a ist mit nominell 54 MBit/s noch schneller, die Ger&auml;te
arbeiten jedoch im 5-GHz-Bereich - bei einem Wechsel mu&szlig; die gesamte Infrastruktur
ausgetauscht werden. Zudem verschlechtert sich mit der doppelten Frequenz
die Reichweite.<br>
Dagegen haben sich die Standards der Reihe IEEE 802.11 etabliert. Ger&auml;te nach dem 
Standard IEEE 802.11g sind abw&auml;rtskompatibel zu 802.11b und senden ebenfalls im 2,4-GHz-Bereich, 
verwenden gegen&uuml;ber der 11-MBit/s-Technik jedoch mehrere Kan&auml;le und kommen so auf eine
Bruttodatenrate von 54 MBit/s. So lassen sich auf den 13 WLAN-Kan&auml;len aber
nur vier 802.11g-Netze am gleichen Ort nebeneinander betreiben. 
Fremde Netze nach 802.11b im Empfangsbereich k&ouml;nnen die 54-Bit/s-Technik jedoch
ausbremsen: Im ung&uuml;nstigsten Fall verteilen sich die langsamen
Netze quer &uuml;ber die Kan&auml;le, sodass keine B&uuml;ndelung f&uuml;r die Breitbandtechnik
mehr m&ouml;glich ist. Weitere St&ouml;rfaktoren sind Bluetooth-Ger&auml;te, auch sie arbeiten
im 2,4-GHz-Bereich. An exponierten Standorten im Stadtgebiet k&ouml;nnen Access Points nach IEEE
802.11g wohl kaum ihre Leistung ausspielen, es gibt einfach zu viele langsame
WLAN-Netze. F&uuml;r den Betrieb in Geb&auml;uden ist die Technik aber durchaus interessant:
St&ouml;rungen von außen gibt es hier kaum. Eigene Access Points nach 802.11b
werden bei Kanal&uuml;berschneidungen umkonfiguriert oder kurzerhand ersetzt,
die Workstations merken wegen der Abw&auml;rtskompatibilit&auml;t von IEEE 802.11g
zu 802.11b nichts davon. Die bisherigen Standards zeigt folgende Tabelle:
<P>
<center>
<img src="images/wlantab.gif">
</center>
<P>
Im einzelnen besitzen die Standards folgende Eigenschaften:

<h4>IEEE 802.11 und IEEE 802.11 b</h4>
Die erste Version des WLAN-Standards wurde 1997 unter der Nummer IEEE 802.11 verabschiedet 
und erlaubt Datentransferraten von 1 Mbit/s und 2 Mbit/s im lizenzfreien 2,4-GHz-ISM-Band 
(Industrial, Scientific, Medical). Im Jahr 1999 folgte die Erweiterung IEEE 802.11 b, die 
Datenübertragungsraten bis 11 Mbit/s im 2,4-GHz-ISM-Band ermöglichte.

<h4>IEEE 802.11 a</h4>
Ebenfalls im Jahr 1999 wurde der im 5-GHzBand arbeitende Standard IEEE 802.11 a
verabschiedet. Dieser Standard nutzt als Modulationsverfahren OFDM (Orthogonal 
Frequency Division Multiplex). Der genutzte Frequenzbereich ist grundsätzlich 
für den WLAN-Bereich reserviert, jedoch nutzen Militär und Flugsicherung ebenfalls 
diesen Bereich. Daher kann dieser Standard in Europa nur innerhalb von Gebäuden und mit 
verringerter Sendeleistung eingeschränkt eingesetzt werden. Auf Grund des Modulations
verfahrens sind aber Übertragungsraten von bis zu 54 Mbit/s möglich.

<h4>IEEE 802.11 e</h4>
Dieser Standard beschreibt einen erweiterten Kanalzugriff, der eine Priorisierung verschiedener 
Verkehrsklassen und eine durch den Access-Point gesteuerte Kanalvergabe erlaubt. Mit dem 
Standard IEEE 802.11 e wird das Konzept des "Quality-of-Service", also die Dienstgüte, unterstützt. 
Besonders interessant ist dieser Standard für Echtzeitanwendungen wie beispielsweise Voice over 
IP.

<h4>IEEE 802.11 g</h4> 
Beim Standard IEEE 802.11 g handelt es sich um die Nutzung des OFDM-Modulationsverfahrens im 
Frequenzbereich von 2,4 Ghlz. Da der IEEE 802.11 g-Standard abwärtskompatibel zum älteren 
IEEE-802,11 b-Standard ist, hat sich der neue Standard sehr schnell verbreitet und wird in den 
nächsten Jahren den Standard IEEE 802.11 b ablösen. Eine Datentransferrate von 54 Mbit/s wird 
erreicht, jedoch ist die Anzahl der benötigten Antennen relativ hoch, damit ein voller Datendurchsatz 
gewährleistet werden kann.

<h4>IEEE 802.11 h</H4>
Der Standard IEEE 802.11 h bietet 54 Mbit/s Datenübertragungsrate und arbeitet im 5-GHz
Bereich. Dieser Standard ergänzt den Standard IEEE 802.11 a um die Funktionalitäten
DFS (Dynamic Frequency Selection) und TPC (Transmit Power Control). Damit fallen
die Einschränkungen des Standards IEEE 802.11 a fort, und das 5-GHz-Band kann so
mit auch im Außenbereich genutzt werden.

<h4>IEEE 802.11 i</h4>
Die Arbeitsgruppe für WLAN-Sicherheit hat im Jahr 2004 den Standard IEEE 802.11 i 
verabschiedet. Bereits seit dem Jahr 2002 gab es mit WPA (WiFi Protected Access) 
übergangsweise einen Standard, der als sicher galt und die wichtigsten Sicherheitslücken
von WEP (Wired Equivalent Privacy) schloss. Der WPA-Standard bietet gegenüber WEP
besseren Schutz durch dynamische Schlüssel, die auf dem TKIP (Temporal Key Integrity
Protocol) beruhen und abwärtskompatibel sind. Weiterhin wird durch die Nutzer-Authentifizierung 
mittels PSK (Pre-Shared Key) oder EAP (Extensible Authentication Protocol) die
Sicherheit erhöht. Der Standard IEEE 802.11 i ist bereits in allen neueren WLAN-Produkten
integriert. Darüber hinaus ermöglicht der Standard IEEE 802.11 i die Verwendung von
AES (Advanced Encryption Standard) zur Verschlüsselung der übertragenen Daten.

<h4>IEEE 802.11 n</h4>
Drahtlose Netzwerke auf Basis des neuen Standards IEEE 802.11 n versprechen erheblich höhere 
Datenübertragungsraten von bis zu 600 Mbit/s. Um diese Werte zu erreichen, wird zur Modulation 
das MCS (Modulation Coding Scheme) genutzt. Hierbei berücksichtigen die beteiligten Geräte 
möglichst viele Parameter, wie beispielsweise Interferenzen, Bewegung des Senders oder 
Abschwächung des Signals und optimieren so die Datenübertragung. In WLANs nach IEEE 802.11 n 
werden zwei bis vier Antennen genutzt. Dadurch kann ein Funkkanal im selben Frequenzbereich 
räumlich mehrfach eingesetzt werden und ermöglicht somit eine parallele Datenübertragung. 
Hierdurch wird nicht nur die Geschwindigkeit, sondern auch die Reichweite erhöht. Dieser 
Mechanismus wird als MIMO (Multiple Input, Multiple Output) bezeichnet.
<p>
Auch für die Zukunft sind bereits neue Spezifikationen innerhalb des Standards IEEE
802.11 angekündigt, beispielsweise der Standard IEEE 802.11 p für den Einsatz in
Fahrzeug-zu-Fahrzeug-Netzen.
<P>

<H3>Modulationsverfahren</H3>
Bei CCK wird nur eine Tr&auml;gerfrequenz moduiert
<p>
Die Komplement&auml;re Code-Umtastung CCK dient als Basismodulation gegenw&auml;rtiger 
WiFi-Systeme nach IEEE 802.11b und moduliert nur einen Tr&auml;ger. 
<p>
<img src="images/funk-bild1.gif">
<p>
Bei der komplement&auml;ren Code-Umtastung werden sowohl Pr&auml;ambel/Header 
als auch die Nutzinformation in CCK-Moduation ausgesendet.
<p>
<img src="images/funk-bild2.gif">
<p>
Parallele Daten&uuml;bertragung im Frequenzmultiplex, kurz OFDM, ist eine 
Technologie, die gerade in den Markt drahtloser lANs eingef&uuml;hrt wird 
und sich in Ger&auml;ten nach IEEE 802.11a f&uuml;r das 5-GHz-Band findet. 
Bis vor Kurzem verhinderten FCC-Vorschriften n&auml;mlich den Einsatz 
von OFDM im 2,4-GHz-Band. Dies &auml;nderte sich im Mai 2001: Seitdem 
ist OFDM auch f&uuml;r das 2,4-GHz-Band zugelassen, so da&szlig; jetzt beide 
B&auml;nder (2,4 und 5 GHz) mit einem einzigen Modulationsformat abgedeckt 
werden k&ouml;nnen. OFDM ist ein Mehrtr&auml;ger-Modulationsverfahren, 
bei dem die Daten auf mehrere, eng beieinander liegende Untertr&auml;ger 
aufgeteilt werden. 
Eine andere entscheidende Eigenschaft von OFDM ist die k&uuml;rzere Pr&auml;ambel: 
Nur 16 ms gegen&uuml;ber 72 ms bei CCK. Eine k&uuml;rzere Pr&auml;ambel 
ist vorteilhaft, da sie weniger Grundaufwand f&uuml;r das Netzwerk bedeutet.
<p>
<img src="images/funk-bild3.gif">
<p>
Auch wenn die Pr&auml;ambel ein unverzichtbarer Teil des Datenpaketes ist, st&ouml;rt 
doch die von ihr beanspruchte Zeit, die f&uuml;r eine Nutzdaten&uuml;bertragung 
nicht mehr verf&uuml;gbar ist. Mit der kurzen Pr&auml;ambel bei OFDM steigt 
also die Nutzdatenrate - eine gute Sache! Reine OFDM-Systeme setzen OFDM 
sowohl f&uuml;r Pr&auml;ambel/Header als auch f&uuml;r die Nutzdaten ein.
Wie der Name schon andeutet, handelt es sich bei CCK/OFDM um ein hybrides 
Verfahren, das als Option im Standardentwurf IEEE 802.11g enthalten ist. 
Wie in Bild 5 verdeutlicht, setzt CCK/OFDM die CCK-Modulation f&uuml;r 
Pr&auml;ambel/Header und OFDM f&uuml;r die Nutzdaten ein. Dabei bleiben 
die Modulationsarten mit dem &Uuml;bergang zwischen Pr&auml;ambel/Header 
und Nutzdatenstrom separat und zeitlich getrennt.
<p>
<img src="images/funk-bild4.gif">
<p>
Dies wirft sofort eine naheliegende Frage auf: Wozu diese Trennung? Wie sich zeigen 
wird, gibt es gute Gr&uuml;nde daf&uuml;r, die optionalen Hybridverfahren 
in den Standardentwurf aufzunehmen. Wenn n&auml;mlich ein Betrieb in Anwesenheit 
existierender WiFi-Ger&auml;te stattfindet, sorgt der ausgesendete CCK-Header 
daf&uuml;r, da&szlig; alle WiFi-Ger&auml;te den Beginn einer Sendung mitbekommen, 
und vor allem, wie lange (in ms) diese Sendung dauern wird. Daraufhin 
folgt die Nutzinformation in OFDM. Auch wenn existierende WiFi-Ger&auml;te 
nicht in der lage sind, diese Nutzinformation aufzunehmen, wissen sie 
doch, wie lange die Sendung dauern wird, und starten in dieser Zeit keine 
Sendeversuche: Dies vermeidet Kollisionen und sorgt f&uuml;r friedliche 
Koexistenz mit neueren Ger&auml;ten nach IEEE 802.11g mit CCK/OFDM-Modulation. 
Da hier die Pr&auml;ambel l&auml;nger ist als bei reinem OFDM, steigt 
der Grundaufwand. Allerdings kann dies leicht in Kauf genommen werden, 
da CCK/OFDM h&ouml;here Datenraten zul&auml;sst (&uuml;ber 20 Mbit/s), 
was diesen Zeitverlust mehr als wettmacht, gleichzeitig aber 
R&uuml;ckw&auml;rtskompatibilit&auml;t mit existierenden CCK-Systemen sicherstellt.
<p>
Es ist immer daran zu denken, da&szlig; CCK/OFDM lediglich als Option im angenommenen 
Standardentwurf IEEE 802.11g enthalten ist. Die verbindlich festgelegte OFDM-Modulation 
kann ebenfalls neben vorhandenen WiFi-Ger&auml;ten existieren und mit 
ihnen zusammenarbeiten. Allerdings ist daf&uuml;r eine andere Methode 
notwendig, die unter RTS/CTS bekannt ist. Diese wird im letzten Abschnitt 
des Artikels n&auml;her betrachtet.
<p>
<img src="images/funk-bild5.gif">
<p>
Das Modulationsverfahren PBCC (Packet Binary Convolutional Coding) basiert 
auf einem Tr&auml;ger, unterscheidet sich aber wesentlich von CCK. Es 
nutzt eine komplexere Signalkonstellation (8-PSK f&uuml;r PBCC statt BPSK/QPSK 
f&uuml;r CCK) und einen Konvolutions-Code statt des Block-Codes bei CCK. 
Damit unterscheidet sich der Decodier-Mechanismus sehr von den bisher 
besprochenen Verfahren. Wie bei CCK/ OFDM handelt es sich bei PBCC auch 
um ein hybrides Verfahren: CCK f&uuml;r Pr&auml;ambel/Header und PBCC 
f&uuml;r die Nutzdaten. Dies erm&ouml;glicht h&ouml;here Datenraten 
bei gewahrter R&uuml;ckw&auml;rtskompatibilit&auml;t mit existierenden 
WiFi-Systemen in gleicher Weise, wie oben f&uuml;r CCK/OFDM beschrieben 
wurde.
<p>
<img src="images/funk-bild6.gif">
<p>
Als maximale 
Datenrate f&uuml;r PBCC sind im Standardentwurf IEEE 802.11g 33 Mbit/s 
festgelegt. Dieser Wert liegt unter den Spitzenwerten f&uuml;r das vorgeschriebene 
OFDM und auch des optional m&ouml;glichen CCK/OFDM. Hier ist festzustellen, 
da&szlig; PBCC als optionales Element auch im urspr&uuml;nglichen Standard 
IEEE 802.11b enthalten ist, wobei aber noch keine Ger&auml;te auf den 
Markt gebracht wurden, die nach diesem Verfahren arbeiten.
<p>
<H4>Verborgene Teilnehmer und RTS/CTS</H4>
Unter &uuml;blichen Betriebsbedingungen k&ouml;nnen sich alle Teilnehmer 
in einem gemeinsamen Kanal auch gegenseitig h&ouml;ren. Es gibt aber 
Situationen, in denen die Partner Kontakt zur Basisstation haben, sich 
aber untereinander nicht h&ouml;ren k&ouml;nnen. Hier n&uuml;tzt der Grundsatz 
"Erst h&ouml;ren, dann sprechen" nichts: Wenn ein Teilnehmer 
einen vermeintlich freien Kanal feststellt und zur Basisstation zu senden 
beginnt, w&auml;hrend diese gerade der Sendung eines anderen Teilnehmers 
lauscht, dann gibt es ein Problem, das auch als das Hidden-Node-Problem 
bekannt ist.
<p>
<img src="images/funk-bild7.gif">
<p>
Zur L&ouml;sung dieses Problems h&auml;lt der Standard 802.11 einen bekannten 
Mechanismus bereit: RTS/ CTS (Request-To-Send/Clear-To-Send). Dazu mu&szlig; 
jeder Teilnehmer eine Sendeanforderung RTS an die Basisstation senden 
und eine CTS-Antwort von der Basisstation abwarten, bevor er seine Sendung 
starten kann. Die Situation von CCK- und OFDM-Partnern, die im gleichen 
Kanal arbeiten, &auml;hnelt sehr dem Hidden-Node-Problem, da die CCK-Partner 
keine OFDM-Sendungen h&ouml;ren k&ouml;nnen. Mit dem RTS/CTS-Mechanismus 
ist es also m&ouml;glich, da&szlig; OFDM-Teilnehmer ohne Kollision im gleichen 
Kanal wie WiFi-Ger&auml;te arbeiten k&ouml;nnen. F&uuml;r den RTS/CTS-Ablauf 
ist eine zus&auml;tzliche Verkehrssteuerung im Netz notwendig. 
<p>

<h3>Sicherheit von Funknetzen</h3>
Der gr&ouml;&szlig;te Vorteil des Mediums Funk ist auch gleichzeitig sein 
gr&ouml;&szlig;ter Nachteil: Die Funkwellen gehen &uuml;berall hin, auch 
dorthin, wo sie nicht hin sollen. Drahtlose Netze bestehen in der Regel aus 
einem Access-Point und einer Anzahl Clients mit drahtlosen Netzwerkkarten. 
Immer h&auml;ufiger sind die notwendigen Zugangspunkte zum Internet, so genannte 
"Hotspots", an Flugh&auml;fen, in Cafes oder Hotels der Großst&auml;dte 
zu finden. Auch zuhause k&ouml;nnen sich Notebook-Nutzer recht einfach 
mit entsprechendem Zubeh&ouml;r einen Hotspot installieren und die Vorteile des 
kabellosen Surfens genießen. Bei vielen handelsüblichen Geräten ist der AP in 
einen DSL-Router integriert. <br>
Im Lieferzustand sind die Ger&auml;te nach dem Auspacken betriebsbereit, nach dem 
Einschalten k&ouml;nnen sich drahtlose Ger&auml;te bereits mit dem Accesspoint verbinden.
In diesem Betriebsmodus besteht aber keinerlei Schutz des Netzwerks gegen&uuml;ber 
der unerw&uuml;nschten Mitbenutzung durch andere Teilnehmer, es ist auf jeden Fall eine 
Konfiguration seitens des Netzwerkbetreibers erforderlich. 
<p>
Ein großes Sicherheitsrisiko, 
das Nutzer von kabellosen Netzwerken haben, ist der Vertraulichkeitsverlust 
durch einen "Lauschangriff". Mittels Notebook und einer WLAN-Karte ist es f&uuml;r 
Dritte nicht allzu schwer, von außen in ein solches Netzwerk zu gelangen. 
Dabei "schmuggelt" sich der Eindringling in die Verbindung zwischen dem HotSpot 
und dem Notebook ein, quasi als "Man-in-the-Middle". Ohne Probleme gelangt 
er so an pers&ouml;nliche Daten oder kann sogar auf Kosten des Besitzers im 
Internet surfen, was viele noch mehr "schmerzen" d&uuml;rfte.
<p>
Inzwischen ist allein durch das Erlauschen des Datenverkehrs ein passiver 
Angriff auf WEP mit handels&uuml;bliche Hardware und frei erh&auml;ltliche 
Software gelungen. Er beruht auf der Tatsache, da&szlig; WEP einen berechneten 
und nicht einen zuf&auml;lligen Initialisierungsvektor im Klartext &uuml;bertr&auml;gt.
So kann aus den erlauschten Daten der bei WEP verwendeten Schl&uuml;ssel errechnet
werden. Nach Sch&auml;tzungen dauert das Berechnen eines 40-Bit-WEP-Schl&uuml;ssels 
eine Viertelstunde, die bessere 128-Bit-Variante mit 104 Bit langem Schl&uuml;ssel 
w&uuml;rde nur rund 40 Minuten dauern.
<p>

<I>Adresse f&uuml;r den Access-Point (SSID) setzen</I><br>
Der <b>Service Set Identifier</b> (SSID) stellt quasi den Namen des Funknetzes 
dar. Sie wird vom Hersteller des AP auf einen Standardnamen gesetzt.
Mit dem SSID bestimmt der Administrator, 
auf welche Access-Points Notebooks oder PCs zugreifen k&ouml;nnen. 
Der SSID benennt einen oder eine Gruppe von Access Points 
(AP). Damit der Anwender drahtlos auf das Netz zugreifen kann, 
m&uuml;ssen auf den Notebooks die entsprechenden SSIDs hinterlegt 
sein. Der SSID funktioniert wie ein einfaches Passwort, wobei 
der Name des Access-Points vom Endger&auml;t &uuml;bermittelt 
wird. Jeder AP ist &uuml;ber seinen mit einem konkreten Wireless LAN 
verkn&uuml;pft. Sendet das Notebook nicht die korrekte Adresse des Access 
Points, so erh&auml;lt der Anwender keinen Zugriff auf die Daten.
<p>
Eine Sicherheitsl&uuml;cke entsteht, wenn der Access-Point so konfiguriert ist, 
dass er seine SSIDs denjenigen Notebooks, die sich anmelden wollen, per 
Broadcastverfahren mitteilt.Ein weiteres Risiko besteht darin, dass die 
Anwender ihre Systeme selbst konfigurieren und anderen Personen die SSIDs 
m&ouml;glicherweise mitteilen. Nach der Einrichtung von WEP/WPA und MAC-Filtern 
sollte das SSID-Broadcasting abgeschaltet werden, da die Clients fest eingerichtet 
sind und eine zyklische Bekanntgabe des Netzwerknamen (SSID-Broadcasting) 
nur noch ein Sicherheitsrisiko darstellt.
<p>
Es versteht sich von selbst, da&szlig; alle voreingestellten Passw&ouml;rter
(z.B. beim AP) ge&auml;ndert werden.
<P>

<I>MAC-Adresse des Endger&auml;ts speichern</I><br>
Anhand der MAC-Adresse kann der Administrator des AP festlegen, welche 
Endger&auml;te Daten &uuml;ber einen Access Point senden oder empfangen 
k&ouml;nnen. Die  MAC-Adresse benennt das Laptop oder den Handheld-Computer. 
Um die Sicherheit in einem drahtlosen Netz zu erh&ouml;hen, l&auml;sst sich 
das System mit einer Liste von MAC-Adressen derjenigen Notebooks programmieren, 
denen Zugriff aufs LAN gestattet ist. Clienten,deren Adresse nicht in der 
Liste enthalten ist, erhalten keinen Zugang zum Access Point.
<p>
Nachteile: Die Liste der Adressen mu&szlig; vom Administrator in jeden 
Access Point manuell eingegeben und aktualisiert werden.<br> 
Viele Netzwerkinterfaces erlauben die Konfiguration einer beliebigen MAC-Adresse, 
wodurch die Sperre unterlaufen werden kann.<br>
Erst in Kombination mit einer Verschl&uuml;sselung stellt diese Ma&szlig;nahme 
eine weitere Steigerung der Sicherheit dar.
Die MAC-Adresse eines Windows-Clients k&ouml;nnen Sie &uuml;brigens durch die
kommandos <tt>ipconfig /all</tt> bzw. <tt>winipcfg</tt> ermitteln.
<P>

<I>Verschl&uuml;sselung der Datenpakete</I><br>
Die WEP-Verschl&uuml;sselung (Wired Equivalent Privacy) soll die Kommunikation 
innerhalb eines WLANs (Wireless Local Area Network) vor Lauschangriffen 
sch&uuml;tzen. Damit Access Point und Notebook miteinander Daten 
ver- und entschl&uuml;sseln k&ouml;nnen, benutzen sie einen identischen 
Code. Das Verschl&uuml;sselungssystem codiert Datenpakete mit 128 Bit.
Die Codierung dient als Zugangskontrolle: Einem Notebook wird der 
Zugriff auf einen AP verweigert, wenn die Schl&uuml;ssel der beiden 
Komponenten nicht &uuml;bereinstimmen.
<p>
Der 802.11-WLAN-Standard sieht kein Protokoll f&uuml;r das Key-Management 
vor, so dass alle Schl&uuml;ssel in einem Netz manuell administriert werden 
m&uuml;ssen. Die WEP-Sicherheit ist in Ad-hoc-Netzen, die keinen Access-Point 
ben&ouml;tigen, nicht verf&uuml;gbar. Die WEP-Verschl&uuml;sselung ist mit
relativ geringem Aufwand zu knacken. 
Im Ernstfall ist die Aufzeichnung und die Analyse von ca. 25 GB Datenverkehr 
ausreichend, um eine WEP-basierende Verschl&uuml;sselung zu knacken und 
erfolgreich &uuml;ber ein drahtloses Netzwerk in die Gesamtstruktur eines 
Unternehmensnetzweks einzudringen.<br>
Bei Verlust eines Notebooks mu&szlig; der Administrator bei allen anderen 
Ger&auml;ten und APs den Schl&uuml;ssel &auml;ndern.
<p>
Im Rahmen der Einrichtung ist es zweckm&auml;&szlig;ig, einen drahtgebundenen 
Zugang zum AP zu haben, um unbeabsichtigte Selbstaussperrungen zu vermeiden.
Viele Ger&auml;te gestatten die Eingabe eines Schl&uuml;sseltextes (im Regelfall 
13 Buchstaben oder Ziffern) zur Erzeugung eines Schl&uuml;sselcodes. Dieses 
Verfahren ist jedoch zwischen den verschiedenen Ger&auml;ten nicht kompatibel, 
bei Problemen sollte hier ein 26-stelliger Hexadezimalcode verwendet werden 
(Schl&uuml;ssell&auml;nge von 128 Bit). 
<p>
 
<I>VPN im WLAN</I><br>
Urspr&uuml;nglich bietet das VPN (Virtual Private Network) einen sicheren "Tunnel" 
durch das weltweite &ouml;ffentliche Netz, seine Sicherheitsverfahren 
lassen sich aber auch auf ein lokales drahtloses Netzwerk anwenden.
In Verbindung mit zentralisierten Authentifizierungsl&ouml;sungen 
wie RADIUS-Servern kommen dabei verschiedene Tunneling-Protokolle zum Einsatz.
<p>
Die bereits vorhandene VPN-Infrastruktur im Unternehmen l&auml;sst sich leicht 
auf das Wireless LAN erweitern. Der Administrationsaufwand ist klein, da sich 
der VPN-Server zentral verwalten l&auml;sst.Es gibt noch Schw&auml;chen 
beim Roaming: Bewegen sich die Anwender von einem zum anderen 
drahtlosen Netz, werden sie zu einem erneuten Log-In aufgefordert.
<P>
F&uuml;r die Absicherung von Funknetzen bleiben damit nur Techniken, wie 
sie in Virtual Private Networks (VPNs) gebr&auml;uchlich sind - also 
Verfahren, die auf h&ouml;heren Netzwerkebenen greifen. Das erfordert 
allerdings einige Umstellungen: Anstatt die Access Points schlicht in die 
bestehende LAN-Infrastruktur zu integrieren, muss man ein separates Netz 
f&uuml;r sie aufbauen. An einem &Uuml;bergabepunkt zwischen WLAN und LAN 
muss dann die Zugriffsberechtigung &uuml;berpr&uuml;ft werden. Man sollte 
dabei nicht nur von der normalen Benutzerverwaltung getrennte Passw&ouml;rter 
verwenden, sondern diese m&ouml;glichst lang machen. Deutlich sicherer geht es 
mit IPsec. 
<p>

<I>Physische Sicherheit</I>
Man sollte gegebenenfalls die physischen Bedingungen in das Sicherheitskonzept 
mit einbeziehen. Bei der Abdeckung eines Gel&auml;ndes oder eines Geb&auml;udes 
ist durch Auswahl der AP-Standorte, der Antennen und der Sendeleistung eine 
Einschr&auml;nkung der Abdeckung auf den erw&uuml;nschten Bereich m&ouml;glich. 
So kann beispielsweise die Installation der APs in den Kellerr&auml;umen eine 
Abdeckung des Geb&auml;udes und des naheliegenden Bereiches bieten, jedoch 
eine Absrahlung auf angrenzende Grundst&uuml;cke wirkungsvoll vermieden werden.
Die Verwendung von Antennen mit bestimmter Abstrahlungscharakteristik kann 
bei komplexen Umgebungen einen deutlichen Sicherheitsgewinn bringen.
<p>

<img src="images/warchalking.gif" align=left hspace=10 vspace=10>
<I>Warchalking</I>
<p>
Unter Warchalking versteht man die &ouml;ffentliche Kennzeichnung offener drahtloser 
Netzwerke (Wireless LAN Hotspots) etwa durch Kreidezeichen an Hausw&auml;nden und auf 
B&uuml;rgersteigen. Genau wie die Reisenden fr&uuml;herer Zeiten sich durch Graffiti &uuml;ber 
die Qualit&auml;t der lokalen Infrastruktur austauschten tun dies auch moderne 
Informationsnomaden. Um &uuml;berall mit dem Internet verbunden zu sein nutzen sie 
oft auch die (unzureichend gesicherten oder absichtlich offen gelassenen) Wireless 
LANs von Institutionen und Privatpersonen, um &uuml;ber diese Netzwerke Verbindung 
mit dem Netz der Netze aufzunehmen. Welche WLAN-Hotspots in Deutschland frei zug&auml;glich
sind erf&auml;hrt man unter <A HREF="http://mobileaccess.de/wlan/">
mobileaccess.de/wlan/</A><br clear=all>
<P>

<h3>Technische Probleme</h3>
WLANs benutzen sehr hohe Frequenzen 2,4 bis 2,5 GHz. In diesem Frequenzbereich
&auml;ndern sich die Ausbreitungsbedingungen im Nahfeld schon mit kleinsten 
Ver&auml;nderungen der Antennenposition und des Umfeldes der Antenne. So 
st&ouml;ren metallische Gegenst&auml;nde in der N&auml;he der Antenne teilweise 
gewaltig. Um die starken Beeinflussungen der Ausbreitung zu verstehen, mu&szlig; 
man die verwendete Wellenl&auml;nge ber&uuml;cksichtigen: 2,4 GHz entsprechen 
etwa 12,7 cm Wellenl&auml;nge. Jeder Gegenstand, der ungef&auml;hr so gro&szlig; 
ist wie die Wellenl&auml;nge, kann die Abstrahlung der Antenne beeinflussen. 
Also nehmen Wasser, Pflanzen, Geb&auml;ude die Sendeenergie auf und setzen diese
in W&auml;rme um. Diese Energie steht dann nicht mehr f&uuml;r weitere Ausbreitung 
zur Verf&uuml;gung. 
<P>
Ein weiterer St&ouml;rfaktor sind Reflektionen. HF Energie wird von manchen 
Oberfl&auml;chen hervorragend reflektiert oder abgelenkt. Dabei kann es zur 
&Uuml;berlagerung des Originalsignals mit dem abgelenkten Signal kommen, was zu 
v&ouml;lliger Ausl&ouml;schung aber auch zu einer Verst&auml;rkung f&uuml;hren kann. 
Durch Reflexionen ver&auml;ndert sich oft auch die Polarisation der Welle. Idealerweise 
sollten Sende- und Empfangsantenne die gleiche Polarisation haben, also beide vertikal 
oder beide horizontal. Ein konkrete, zuverl&auml;ssige Vorhersage welche Antennen 
welche Reichweiten bringen ist ohne genaue Betrachtung der Umgebung nicht m&ouml;glich. 
<P>
W&uuml;nschenswert sind d&uuml;nne Kabel wegen ihrer gr&ouml;&szlig;eren Flexibilit&auml;t, 
Aber gerade die d&uuml;nnen Kabel sogen f&uuml;r eine starke KabelD&auml;mpfung, die in
in dB/100 m angegeben wird.
Verringern l&auml;sst sich die Kabeld&auml;mpfung nur durch dickere Kabel, das liegt an
der Physik. Das Problem ist, da&szlig; man zwar mit dicken Kabel im Aussenbereich
und an einer festmontierten Antenne gut arbeiten kann, ein Notebook oder
ein leichter Accesspoint aber vom dicken Kabel einfach weggehoben werden
w&uuml;rde. Dadurch wird die Mobilit&auml;t des WLANs wieder eingeschr&auml;nkt. 
Um dieses Problem zu umgehen, wird mit sogenannten "Pigtails" gearbeitet. Dies sind kurze,
hochflexible Kabelst&uuml;cke mit den entsprechenden Steckern, die vom Notebook
oder AP auf das dicke Kabel adaptieren. Dadurch kommt zwar wieder ein etwas
st&auml;rker d&auml;mpfendes Kabel ins Spiel, aber das System bleibt flexibel. 
Dazu kommt noch das die &uuml;blichen Winzigstecker der Accesspoints oder PCMCIA-Karten 
gar nicht an ein dickes Kabel montiert werden k&ouml;nnen.  Die folgende Tabelle zeigt
typische D&auml;mpfungswerte von HF-Kabeln:
<P>
<table border="1" cellspacing="0" cellpadding="3">
<tr><td valign="top"><b>Kabeltyp</b></td>
<td valign="top"><b>D&auml;mpfung bei 2.4 Ghz db/100m</b></td>
</tr><tr>
<td valign="top">RG58</td><td valign="top">107</td>
</tr><tr>
<td valign="top">RG213</td><td valign="top">46</td>
</tr><tr>
<td valign="top">Aircom Plus</td><td valign="top">21,5</td>
</tr><tr>
<td valign="top">Aircell 7</td><td valign="top">39</td>
</tr></table>
<p>

<h4>WLAN-Stecker</h4>
<table border="1" cellspacing="0" cellpadding="3" width="50%">
<tr><td valign="top">Lucent (Orinoco)
</td><td>Sehr kleiner Stecker, der nur bei PCMCIA-Karten verwendet wird. 
Passt nur an RG-316- oder RG-174-Kabel. 
</tr>
<tr><td valign="top">MMCX
</td><td>Sehr kleiner Stecker der nur bei PCMCIA Karte Verwendung findet. Passt nur
an RG-316 und RG-174 Kabel.z.b. bei Cisco Aironet 350.</tr>
<tr><td valign="top">SMA
</td><td>Kleiner Stecker f&uuml;r Access-Points, PCI-Karten o.&auml;. Kann an RG-316-, 
RG-58- und RG213-Kabel angeschlagen werden.<br>SMA-Stecker: Innengewinde und innen Stift.
<br>SMA-Buchse: Aussengewinde und innen Kelch.</tr>
<tr><td valign="top">Reverse-SMA
</td><td>Wird sehr oft im WLAN-Bereich verwendet. z.B. D-Link Reverse-SMA.
<br>Reverse-SMA-Stecker: Innengewinde und innen Kelch. <br>Reverse-SMA-Buchse: 
Aussengewinde und innen einen Stift.</tr>
<tr><td valign="top">TNC
</td><td>Etwas gr&ouml;&szlig;erer Stecker, wird gelegentlich an WLAN-Accesspoints und 
-Clients gefunden. Passt an RG-316-, RG-58- und RG213-Kabel. Achtung: Es gibt dieses
System umgekehrt: Buchse (Kelch) anstelle des Stiftes f&uuml;r den Innenleiter, es nennt 
sich dann "Reverse-TNC". Wird h&auml;ufiger im WLAN-Bereich verwendet. z.B. von Cisco. </tr>
<tr><td valign="top">N
</td><td>Der Stecker f&uuml;r professionelle Montage und praktisch alle Kabeltypen. Dicke
Kabel zur Antenne sollte man immer mit N-Stecker ausr&uuml;sten. Die Verbindung zum Notebook/AP 
wird dann mit einem Pigtail mit N-Buchse adaptiert.</tr>
</table>
<p>

<H2><A NAME="10.5">Weitere drahtlose Verfahren</A></H2>
Das Nebeneinander verschiedener kabelloser
Vernetzungstechniken ist nicht leicht zu durchschauen. Hier ein
&Uuml;berblick &uuml;ber Technik und Anwendung g&auml;ngiger
Systeme, die f&uuml;r den Heimbereich geeignet sind.
<P>
<H4>WiMAX</H4>
Die Wireless-Technologie Worldwide Interer operability for 
Microwave Access (WiMAX) hat nicht zuletzt aufgrund ihrer 
vielfältigen Anwendungsmöglichkeiten eine beachtliche
Zukunft vor sich. Vor allem die breitbandige High-Speed-Übertragung 
zu mobilen Endgeräten nach dem Standard IEEE 802.16e verspricht 
eine weitergehende Verbreitung. Das Spektrum der WiMAX-Anwendungen
reicht von der "Richtfunk-Anbindung" von Wohngebieten oder 
Industriekomplexen über die Versorgung mobiler Laptops bis hin 
zur Datenversorgung in Städten oder auch in größeren Gebieten, in 
denen sich wegen der dünnen Besiedelung das Verlegen von Kabeln nicht 
lohnt (Gebiete also, die niemals in den Genuss von DSL kommen werden). 
Die Funkzellendurchmesser betragen bis zu 20 km (typisch 10 km oder
weniger). Auch die Installationskosten sind relativ niedrig, sie
betragen etwa ein Drittel der Kosten für das
Universal-Mobile-Telecommunications-System (UMTS).
Die (Mobil-)Übertragungsraten liegen in der Praxis zwischen
5 Mbit/s und etwa 25 Mbit/s. Die heute bereits in vielen Ländern zur 
drahtlosen Breitband-Versorgung eingesetzte WiMAX-Technik beruht auf 
dem Standard IEEE 802.16. Bei der aktuellen Version ist der Wechsel der 
Funkzelle noch nicht möglich, die Anwendung ist also auf echte 
Festverbindungen ausgerichtet. Ende 2005 hat das IEEE-Gremium dann die
Version 802.1 6e verabschiedet, womit auch der Wechsel der Funkzelle mit 
mobilen Endgeräten möglich sein wird. Die notwendigen Frequenzbereiche
bei 2,5 GHz und 3,5 GHz sind verfügbar. Es wurde auch ein Quality of Service
festgelegt, der auch Sprachübertragung erlaubt.
<P>
<H4>IrDA</H4>
Der IrDA (Infrared Data Association) - Standard
f&uuml;r den Kurzstreckenbereich (wenige Meter) geh&ouml;rt schon
fast zu den Veteranen der drahtlosen Technologien. Entsprechende
Hardware ist sehr preisg&uuml;nstig und heute Grundausstattung in
Notebooks, Palm-, Handspring- und CE-Plattformen sowie Handys.
Mobile Telefone mit Infrarotschnittstelle gibt es beispielsweise
von Siemens, Nokia, Qualcomm, Motorola und Ericsson. Seit einigen
Monaten wird die Infrarot-Technologie mit 16 MBit/s-Transceiver
ausgeliefert. Ein schwerwiegendes Handikap hat die IrDA-Technik,
denn Sender und Empf&auml;nger ben&ouml;tigen eine direkte
Sichtverbindung. Dieses Manko hat sich in der Praxis als so
drastisch erwiesen, da&szlig; die Akzeptanz von IrDA sehr nachgelassen
hat. Die Hersteller haben bereits reagiert - in vielen F&auml;llen
wird wohl IrDA demn&auml;chst von Bluetooth ersetzt, obwohl IrDA
mit seinem Licht-&Uuml;bertragungsmedium keine Rangeleien um
Funkfrequenzen kennt und nat&uuml;rlich auch keinerlei
m&ouml;glicherweise gesundheitssch&auml;dliche
Mikrowellen-Strahlung emittiert. Eine weitere Einschr&auml;nkung
der IrDA-Anwendung: Es sind nur Punkt-zu-Punkt-Verbindungen
m&ouml;glich.
<P>
<H4>Bluetooth</H4>
&Uuml;ber 200 Hersteller ziehen an einem Strang und entwickeln ein Verfahren zur 
drahtlosen Integration mobiler Ger&auml;te. Aus dem Projekt mit Codenamen "Bluetooth" 
ging bis zur CeBIT 1999 die erste Version einer Spezifikation hervor. 
Wer oder was ist "Bluetooth"? Der Held, um den es hier geht, regierte vor 1000 
Jahren D&auml;nemark und hie&szlig; Harald Blaatand, zu deutsch Blauzahn. Eines 
der wenigen Zeugnisse f&uuml;r die Existenz des K&ouml;nigs legt ein j&uuml;tl&auml;ndischer 
Runenstein ab, auf dem steht: "... Harald, der ganz D&auml;nemark und Norwegen 
gewann und die D&auml;nen christianisierte." Was dieser Herrscher vergangener 
Tage mit drahtlosem Datenaustausch zu tun hat, versucht eine Powerpoint-Pr&auml;sentation 
der "Bluetooth Special Interest Group" zu deuten: "Harald glaubt, 
da&szlig; mobile PCs und Handys kabellos miteinander kommunizieren sollten." 
Im Fr&uuml;hjahr 1998 beschlossen die Hersteller Ericsson, IBM, Intel, Nokia und 
Toshiba, gemeinsam eine Technik f&uuml;r die kurzreichweitige Funkverbindung von 
PCs, digitalen Kameras, Mobiltelefonen und anderen tragbaren Ger&auml;ten zu entwickeln. 
Als Forum f&uuml;r den Austausch von Ideen gr&uuml;ndeten sie die "Bluetooth Special 
Interest Group", eine Arbeitsgruppe, die zun&auml;chst Rahmenbedingungen formulierte 
und nach und nach einen Standard festlegen sollte. Die Initiatoren hatten ein 
Verfahren im Visier, das Anwendern von Notebooks das Leben erleichtert. Dementsprechend 
sollte die drahtlose Technik
<UL> 
<tr> Stimme und Daten &uuml;bertragen, 
<tr> &uuml;berall funktionieren, 
<tr> automatisch Verbindungen aufbauen, 
<tr> St&ouml;reinfl&uuml;ssen von Mikrowellenherden widerstehen, 
<tr> mit kleinen Chips arbeiten, die auch in Handys passen, 
<tr> wenig Strom verbrauchen, 
<tr> auf offenen Standards beruhen und 
<tr> sehr billig sein. 
</UL>
Am 20. Mai 1998 gab die Special Interest Group Einzelheiten zur Technik bekannt 
und begr&uuml;&szlig;te neue Mitglieder: 3Com, Axis, Cetecom, Compaq, Dell, Lucent, 
Motorola, Puma, Qualcomm, Symbionics TDK, VLSI und Xircom. F&uuml;nf Monate sp&auml;ter 
wurde von bis dahin mehr als 200 Mitgliedern auf einer Entwicklerkonferenz in 
Atlanta die Version 0.7 der Bluetooth-Spezifikation aus der Taufe gehoben. Heute 
z&auml;hlt die Teilnehmerliste rund 520 Eintr&auml;ge. 
Nun steht die Herausgabe der endg&uuml;ltigen Fassung 1.0 des Reglements kurz bevor. 
Nach dem Kalender der Bluetooth-Gruppe sollte das Dokument im 1. Quartal 1999 
erscheinen, nach M&ouml;glichkeit bis zur CeBIT. Bis dahin blieben Detailinformationen 
in den H&auml;nden der Mitglieder. Kurz nach der Ver&ouml;ffentlichung, so lauten 
die Pl&auml;ne, werden Entwicklungswerkzeuge f&uuml;r Bluetooth-Anwendungen erh&auml;ltlich 
sein. Die ersten Produkte schlie&szlig;lich, welche die Technik umsetzen, k&ouml;nnten 
dann in der zweiten Jahresh&auml;lfte auf den Markt gehen. Auch wenn es bislang 
nocht keine Bluetooth-Chips zu kaufen gibt, k&ouml;nnen wir schon davon tr&auml;umen; 
die Web-Site der Arbeitsgruppe (<A HREF="http://www.bluetooth.org">http://www.bluetooth.org</A>) 
versorgt uns mit gen&uuml;gend Stoff:  
<UL>
<tr> Handys schalten am Arbeitsplatz automatisch auf den kostenlosen Betrieb im firmeninternen 
Telefonnetz um und funktionieren zu Hause als Schnurlosapparate im Festnetz. 
<tr> Die Teilnehmer einer Konferenz brauchen ihre Notebooks nur einzuschalten, um 
sie miteinander zu verbinden. Auch der Referent braucht kein Kabel, wenn er den 
Projektor an einen PC anschlie&szlig;t. 
<tr> E-Mail, die der Anwender im Flugzeug auf seinem Notebook verfa&szlig;t, wird 
abgeschickt, sobald er nach der Landung sein Handy auf Stand-by schaltet. 
<tr> Der PDA des Au&szlig;endienstmitarbeiters tauscht selbst&auml;ndig mit dem PC 
im B&uuml;ro Informationen aus und aktualisiert seine Daten. 
</UL>
Das Verfahren, nach dem Bluetooth-Ger&auml;te arbeiten, gr&uuml;ndet zum Teil auf 
dem Standard 802.11 des Institute of Electrical and Electronics Engineers (IEEE). 
Eine 9 mal 9 Zentimeter gro&szlig;e Chipkarte sendet im Mikrowellenbereich von 
2,4 GHz bis 2,48 GHz. Dieser Abschnitt des geb&uuml;hrenfreien ISM-Bands (ISM = 
Industrial, Scientific and Medical) liegt sehr nahe an der Arbeitsfrequenz eines 
Mikrowellenherds, dessen Magnetron in der Regel mit 2,450 GHz schwingt. Da&szlig; 
der Funkverkehr trotzdem st&ouml;rungsfrei verl&auml;uft und auch neben anderen 
Wireless-Netzen funktioniert, soll eine Technik garantieren, die sich in dem sogenannten 
Baseband-Protokoll manifestiert. Hierin ist festgelegt, da&szlig; die Tr&auml;gerfrequenz 
nicht konstant bleibt, sondern in einer zeitlichen Abfolge verschiedene Werte 
aus einer festen Menge von Frequenzen annimmt. Der Sender springt bis zu 1600 
mal in der Sekunde zwischen 79 Stufen einer Frequenztreppe, die mit 1 MHz gro&szlig;en 
Abst&auml;nden den Bereich von 2402 MHz bis 2480 MHz abdecken. Ein Ger&auml;t, das 
die Nachricht empfangen will, mu&szlig; mit dem Sender synchronisiert sein und 
genau die gleiche Sprungfolge f&uuml;r die Tr&auml;gerfrequenz verwenden. Nur Nachrichten, 
die diesen Fingerabdruck tragen, landen bei den Teilnehmern eines Bluetooth-Netzes, 
Signale anderer Quellen werden herausgefiltert. Die Daten schlie&szlig;lich werden 
der Sprungfolge durch eine bin&auml;re Frequenzmodulation angeh&auml;ngt.  
Bluetooth kann in einem asynchronen Modus Pakete &uuml;bertragen, wobei in der 
Regel auf einen Slot, das hei&szlig;t pro Element der Sprungfolge, ein Paket zu 
liegen kommt. Der Austausch erfolgt entweder symmetrisch mit einer Datenrate von 
432 KBit/s oder asymmetrisch mit 721 KBit/s in einer Richtung und 57,6 KBit/s 
in der anderen. Reservierte Zeitfenster erm&ouml;glichen dabei einen Full-Duplex-Betrieb, 
bei dem Kommunikationspartner zur selben Zeit senden und empfangen d&uuml;rfen. 
Alternativ zur Datenleitung kann eine Verbindung auch gleichzeitig drei Sprachkan&auml;le 
mit jeweils 64 KBit/s Bandbreite unterbringen. Zum Umwandeln von Sprache in ein 
digitales Signal dient "Continuous Variable Slope Delta Modulation", ein 
Verfahren, das gegen&uuml;ber Bitfehlern als vergleichsweise unempfindlich eingesch&auml;tzt 
wird. 
<P> 
Ein Bluetooth-Netz ist aus einzelnen Blasen, sogenannten Piconets, aufgebaut, 
die jeweils maximal acht Ger&auml;te aufnehmen. Damit auch mehrere Teilnehmer drahtlos 
kommunizieren k&ouml;nnen, treten bis zu zehn Piconets eines Empfangsbereichs miteinander 
in Kontakt. Der Gr&uuml;nder eines Teilnetzes, n&auml;mlich das Ger&auml;t, welches 
die erste Verbindung herstellt, nimmt unter den &uuml;brigen Mitgliedern eine prim&auml;re 
Stellung ein und gibt die innerhalb des Piconet gebr&auml;uchliche Sprungfolge 
vor. Damit die anderen Ger&auml;te Schritt halten, schickt der Master Synchronisationssignale. 
Au&szlig;erdem f&uuml;hrt er Buch &uuml;ber die drei Bit langen Mac-Adressen der 
Piconet-Teilnehmer und versetzt diese nach Bedarf in eingeschr&auml;nkte Betriebszust&auml;nde. 
<P>
Den Aufbau einer Verbindung &uuml;bernimmt das Software-Modul "Link-Manager". 
Dieses entdeckt andere Link-Manager in einem Empfangsbereich, mit denen es &uuml;ber 
ein eigenes Protokoll, das Link-Manager-Protokoll, Daten austauscht. Das Modul 
authentifiziert Ger&auml;te, behandelt Adre&szlig;anfragen, verf&uuml;gt &uuml;ber 
eine einfache Namensaufl&ouml;sung und sendet und empf&auml;ngt Anwendungsdaten. 
Dar&uuml;ber hinaus handelt es mit dem Kommunikationspartner den Verbindungstyp 
aus, der bestimmt, ob Sprache oder Daten &uuml;ber den &Auml;ther gehen. Auch an 
die Sicherheit haben die Entwickler gedacht. Bluetooth-Ger&auml;te weisen sich 
gegenseitig mit einem Challenge/Response-Mechanismus aus und kodieren Datenstr&ouml;me 
mit Schl&uuml;sseln von bis zu 64 Bit L&auml;nge. Abgesehen davon haben es Mith&ouml;rer 
wegen der gro&szlig;en Zahl m&ouml;glicher Sprungfolgen schwer, sich in ein Piconet 
einzuklinken. 
<P>
Eine Mitgliedschaft in der Special Interest Group ist f&uuml;r Unternehmen der 
EDV-Branche aus zweierlei Hinsicht interessant. Zum einen erhalten Entwickler 
die Gelegenheit, die Spezifikation nach ihren Vorstellungen mitzugestalten. So ist von 
den Gr&uuml;ndern der Gruppe die Firma Ericsson f&uuml;r weite Teile des Baseband-Protokolls 
verantwortlich, w&auml;hrend die Module f&uuml;r die PC-Integration von Toshiba 
und IBM stammen, Intel Wissen &uuml;ber integrierte Schaltungen einbringt und Nokia 
Software f&uuml;r Mobiltelefone liefert. Zum anderen bekommen Teilnehmer Zutritt 
zu den Vorabversionen des Standards und k&ouml;nnen fr&uuml;hzeitig mit der Entwicklung 
von Bluetooth-konformen Ger&auml;ten und Programmen beginnen. Wer sich in die Gruppe 
aufnehmen lassen will, besucht die Bluetooth-Web-Site und schickt unter dem Link 
"Members" eine E-Mail mit verschiedenen Angaben an eines der f&uuml;nf Gr&uuml;ndungsmitglieder. 
Kurz darauf erh&auml;lt der Bewerber in elektronischer Form zwei Vertragsformulare, 
die er unterschrieben per Post zur&uuml;ckschickt. Das eine, genannt "Adopters 
Agreement", sichert dem Teilnehmer die geb&uuml;hrenfreie Benutzung der Spezifikation 
f&uuml;r eigene Produkte, die ein Bluetooth-Label tragen d&uuml;rfen. Wie das lauten 
wird, hei&szlig;t es dort - denn Bluetooth ist lediglich ein vorl&auml;ufiger Codename 
des Projekts -, entscheidet Ericsson. Die Vertragsanlage "Early Adopter Amendment" 
verpflichtet jene, die vor der Ver&ouml;ffentlichung des Standards beitreten, die 
Dokumente vertraulich zu behandeln. 
<P>
Damit Produkte das Bluetooth-Label erhalten, m&uuml;ssen sie nicht nur das Baseband-Protokoll 
unterst&uuml;tzen. Je nach ihrem Einsatzgebiet m&uuml;ssen sie auch mit Protokollen 
der Anwendungsebene arbeiten und verschiedene Datenobjekte integrieren. Mobiltelefone 
zum Beispiel sollten mit PCs oder PDAs elektronische Visitenkarten des V-Card-Standards 
austauschen, wohingegen ein Kopfh&ouml;rer weniger Aufgaben zu erledigen hat. Bluetooth-Ger&auml;te 
bauen dabei nicht nur selbst&auml;ndig Verbindung zu ihren Kollegen auf, sie erkennen 
auch, mit welchen F&auml;higkeiten diese ausgestattet sind. 
<P>
Die Datenrate eignet sich eher f&uuml;r
Anwendungen mit seltenem Datenaustausch in meist kleinem Umfang. So
bildet Bluetooth keine Konkurrenz zu Wireless-LANs (WLANs), da dort
inzwischen Bandbreiten von 11 MBit/s eingef&uuml;hrt wurden. Die
wesentlichen Bluetooth-Applikationen, die in Betrieben von
Mitarbeitern angenommen werden, bestehen aus unternehmenseigen
Anwendungen wie Messaging, Knowledge Management (Unwired Portal),
Datenbankabfragen usw. sowie dem Zugang zum Internet.
<P>

<h2>Breitband-Netze (Kabelnetz)</h3>
Ein Breitbandnetz ist ein Datennetz, das die digitalen Daten nicht im Basisband
überträgt, sondern auf einen oder mehrere hochfrequente Träger aufmoduliert. 
Dabei werden in der Regel verschiedene Frequenzbereiche für Sende- und 
Empfangsdaten benutzt. Die Breitbandtechnik erlaubte in den 1980er Jahren 
die Kabelfernsehtechnik. Heutige Anwendungen der Breitbandtechnik sind 
das Rundfunk-Kabelnetz und Internetanschlüsse über  dieses Kabelnetze.
<P>
Mit dem analogen und digitalen Kabelfernsehangebot begann die Ausbreitung der 
Kabelnetzte. Inzwischen haben fast alle Kabelnetzbetreiber ihre Netze auf 
breitbandige Dienste mit Rückkanal erweitert. Dadurch kann der Kunde unter 
Benutzung eines Kabelmodems Telefonie- und internetbasierende Dienste 
den Breitband-Kabelzugang nutzen. Das zentrale Element der Kabelnetz-Architektur 
ist das CMTS (Cable Modem Termination System) in der Kopfstation, die 
Vermittlungsstelle im Kabelsystem. Hier laufen alle Verbindungen zusammen.
Um eine schnelle Datenübertragung zu realisieren besteht das Netz aus einer 
Kombination von Glasfaser- und Koaxialkabeln. In der Kopfstation werden von 
der Master-Kopfstation die TV- und Radio-Programme sowie ggf. die Telefonie-
und die Internet-Verbindung eingespeist. 
<p>
An der Kopfstation sind mehrere Hubs angeschlossen. Von den Hubs aus verläuft 
das verzweigte Koaxial-Kabelnetz, an dem die einzelnen Kunden angeschlossen sind. 
In regelmäßigen Abständen sind Signalverstärker für die Aufbereitung des Signals 
verantwortlich.
<p>
<center><img src="images/kabelnetz.gif"></center>
<p>
Bei Mehrfamilienhäusern sorgt ein spezieller Kabelverteiler für die Verstärkung 
des Signals und für die Verteilung in die einzelnen Wohnungen. Er sorgt auch
für die Rückkanalfähigkeit der Hausanlage. Vom Hub ausgehend handelt es sich um
das eigentliche Kabelnetz mit baumförmiger Struktur. Prinzipiell erlaubt eine 
solche Struktur nur eine Punkt-zu-Mehrpunkt-Kommunikation. Das Kabel ist ein 
"shared medium". An einem Ast hängen immer mehrere Teilnehmer. Das bedeutet, 
dass sich alle Teilnehmer an einem Hub die vorhandene Bandbreite teilen müssen. 
Im Durchschnitt kann jeder Hub etwa 5000 Teilnehmer ohne Probleme bedienen.
<p>

<CENTER><TABLE BORDER=0 WIDTH="100%">
<TR>
<TD ALIGN=LEFT VALIGN=BOTTOM><img src="images/left.gif" BORDER=0> <A HREF="netz9.html">Zum vorhergehenden Abschnitt</A></TD>
<TD ALIGN=CENTER VALIGN=BOTTOM><img src="images/up.gif" BORDER=0> <A HREF="index.html">Zum Inhaltsverzeichnis</A></TD>
<TD ALIGN=RIGHT VALIGN=BOTTOM><img src="images/right.gif" BORDER=0> <A HREF="netz11.html">Zum n&auml;chsten Abschnitt</A></TD>
</TR></TABLE></CENTER>
<P><HR>
<h6><i>Copyright &copy; Hochschule M&uuml;nchen, FK 04, Prof. J&uuml;rgen Plate</i><br>
Letzte Aktualisierung: <SCRIPT LANGUAGE="JavaScript">document.write(document.lastModified);</SCRIPT></I></H6>
</BODY>
</HTML>
