<html>
<head>
<title>Grundlagen Computernetze</title>
</head>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#0000FF" ALINK="#FF0000" VLINK="#FF00FF">
<CENTER><TABLE BORDER=0 WIDTH="90%" >
<TR><TD ALIGN=LEFT><img src="images/eyes.gif"></TD>
<TD ALIGN=RIGHT><H3>Grundlagen Computernetze</H3> 
<BR><B><I>Prof. J&uuml;rgen Plate</I></B></TD></TR>
</TABLE></CENTER>
<HR>

<h1 align=center>Logische Struktur von Netzen</h1>

In diesem Abschnitt wird ganz knapp die logische Struktur von Netzen behandelt,
also die Art und Weise, wie die einzelnen Stationen miteinander verbunden
werden. Bei der Verkabelung von LANs mu&szlig; man aber zwischen logischer
Stuktur und Verkabelungsstruktur unterscheiden, z. B. kann ein Netz mit
logischer Busstruktur bei der Verkabelung mit 'Twisted Pair'-Kabeln wie
ein Sternnetz aussehen.<BR>

<H3>Sternstruktur</H3>
Alle Teilnehmer werden an einen zentralen Knoten angeschlossen (fr&uuml;her
z. B. h&auml;ufig Anschlu&szlig; von Sichtger&auml;ten an einen Zentralrechner).
Eine direkte Kommunikation der Teilnehmer untereinander ist nicht m&ouml;glich,
jegliche Kommunikation l&auml;uft &uuml;ber den zentralen Knoten (Punkt-zu-Punkt-Verbindung,
Leitungsvermittlung). Die Steuerung der Kommunikation vom Knoten aus ist
sehr einfach: Polling (regelm&auml;&szlig;ige Abfrage aller Stationen) oder
Steuerung &uuml;ber Interrupt. Bei Ausfall der Zentrale sind s&auml;mtliche
Kommunikationswege unterbrochen.<BR>
<P>
<center><img src="images/b1-1.gif" ALT="Schema der Sternstruktur"></center>
<P>
<H3>Ringstruktur</H3>
Es gibt keine Zentrale, alle Stationen sind gleichberechtigt. Jeder Teilnehmer
verf&uuml;gt &uuml;ber einen  eigenen Netzanschlu&szlig; (Knoten) und ist
&uuml;ber diesen mit seinem linken und rechten Partner verbunden. Die &Uuml;bertragung
der Info erfolgt in einer Richtung von Knoten zu Knoten. Bei Ausfall eines
Knotens sind s&auml;mtliche Kommunikationswege unterbrochen.
<P>
<center><img src="images/b1-2.gif" ALT="Schema des Ringes"></center>
<P>

<H3>Busstruktur</H3>
Es gibt keine Zentrale und keine Knoten. Die Verbindung aller Teilnehmer
erfolgt &uuml;ber einen gemeinsamen &Uuml;bertragungsweg. Zu einem Zeitpunkt
kann immer nur eine Nachricht &uuml;ber den Bus transportiert werden. Bei
Ausfall einer Station bleibt die Kommunikation der anderen Stationen erhalten.
Bei den Bussystemen kann man noch unterscheiden in Basisband-Bussysteme
und Breitband-Bussysteme. Bei Basisband-Bussystemen werden die elektrischen
Pegel direkt &uuml;bertragen; bei den f&uuml;r uns interessanten digitalen
Informationen also 0- und 1-Pegel. Bei Breitband-Bussystemen werden &uuml;ber
das Kabel mehrere unabh&auml;ngige Kan&auml;le geleitet (modulierte &Uuml;bertragung).
Busnetze m&uuml;ssen auf beiden Seiten mit der Leitungsimpedanz abgeschlossen
werden, damit keine Echos auftreten, die zu Empfangsfehlern f&uuml;hren.
<P>
<center><img src="images/b1-3.gif" ALT="Schema einer Busstruktur"></center>
<P>

<H3>vermaschte Struktur</H3>
Jeder Teilnehmer ist mit mehreren anderen verbunden. Es gibt keine Zentrale
und es existieren mehrere, unabh&auml;ngige &Uuml;bertragungswege zwischen
zwei Stationen. Manchmal gibt es keine direkte Verbindung zwischen
zwei Stationen. Dann f&uuml;hrt der Weg &uuml;ber eine oder mehrere andere
Stationen.<BR>
<P>
<center><img src="images/b1-4.gif" ALT="Vermaschte Struktur eines Netzes"></center>
<P>
Je nach Bedarf k&ouml;nnen die o. g. Topologien auch miteinander kombiniert
werden, z. B. Bus mit angeschlossenen Sternen oder Bus mit angeschlossenen
Bussen, was zu einer Baumstruktur f&uuml;hrt. Insbesondere bei Weitverkehrsnetzen
(WAN) treten vermaschte Strukturen auf. Teilweise ergeben sich dabei redundante
Leitungswege, die auch bei Unterbrechung eines Wegs den Datentransport sicherstellen.
<P>

<CENTER><TABLE BORDER=0 WIDTH="100%">
<TR>
<TD ALIGN=LEFT VALIGN=BOTTOM><img src="images/left.gif" BORDER=0> <A HREF="netz0.html">Zum vorhergehenden Abschnitt</A></TD>
<TD ALIGN=CENTER VALIGN=BOTTOM><img src="images/up.gif" BORDER=0> <A HREF="index.html">Zum Inhaltsverzeichnis</A></TD>
<TD ALIGN=RIGHT VALIGN=BOTTOM><img src="images/right.gif" BORDER=0> <A HREF="netz2.html">Zum n&auml;chsten Abschnitt</A></TD>
</TR></TABLE></CENTER>
<P><HR>
<h6><i>Copyright &copy; Hochschule M&uuml;nchen, FK 04, Prof. J&uuml;rgen Plate</i><br>
Letzte Aktualisierung: <SCRIPT LANGUAGE="JavaScript">document.write(document.lastModified);</SCRIPT></I></H6>
</BODY>
</HTML>
